{"compliant": [{"section": "Targeting or Advertising", "article numbers": "Article 6(1)(f)", "legal provisions": "Legitimate interests"}, {"section": "Analytical, targeting and advertising cookies, and the User Activity Information generated from these cookies, are created, stored and/or managed by third-party service providers that provide us with web traffic analytics, sales engagement and marketing automation services, such as Google Analytics", "article numbers": "Article 28", "legal provisions": "Data processor agreement"}, {"section": "Disabling Cookies and Similar Technologies", "article numbers": "Article 7", "legal provisions": "Right to withdraw consent"}, {"section": "How We Share Your Information", "article numbers": "Article 13", "legal provisions": "Information to be provided where personal data are collected from the data subject"}, {"section": "With Other Users", "article numbers": "Article 6(1)(a)", "legal provisions": "Consent"}, {"section": "With Service Providers", "article numbers": "Article 28", "legal provisions": "Data processor agreement"}], "non_compliant": [{"section": "Targeting or Advertising", "article numbers": "Article 13", "legal provisions": "Information to be provided where personal data are collected from the data subject", "amend": "The policy should explicitly state the purpose of data processing for targeting and advertising, including the specific legitimate interests pursued. It should also clearly inform users about the categories of data processed for these purposes."}, {"section": "Disabling Cookies and Similar Technologies", "article numbers": "Article 14", "legal provisions": "Information to be provided where personal data are not obtained from the data subject", "amend": "The policy should provide clear and concise information about the cookies and similar technologies used, including their purpose, the categories of data processed, and the retention period. It should also explain how users can exercise their right to object to the processing of their data for direct marketing purposes."}, {"section": "How We Share Your Information", "article numbers": "Article 13", "legal provisions": "Information to be provided where personal data are collected from the data subject", "amend": "The policy should provide more specific information about the categories of recipients with whom data is shared, including the purpose of sharing and the legal basis for doing so. It should also explain the safeguards in place to protect data when shared with third parties."}, {"section": "With Service Providers", "article numbers": "Article 28", "legal provisions": "Data processor agreement", "amend": "The policy should explicitly state that the data processor agreement with service providers complies with the requirements of Article 28, including the specific obligations of the processor regarding data security, confidentiality, and data subject rights."}, {"section": "Although your browser may allow you to transmit a “Do Not Track” or “opt-out preference” signal, like many websites, our website is not designed to respond to such signals, and we do not use or disclose your information in any way that would legally require us to recognize opt-out preference signals", "article numbers": "Article 21", "legal provisions": "Right to object", "amend": "The policy should clearly state whether the website responds to Do Not Track signals and how users can exercise their right to object to the processing of their data for direct marketing purposes."}]}
