{"compliant": [{"section": "5.1 We will only collect and use your personal data for the purposes described in this Privacy Policy or for which we have obtained your consent.", "article numbers": "6(1)", "legal provisions": "Lawfulness of processing"}, {"section": "5.2 We may share your personal data with third parties, including but not limited to:\n(A) Our service providers who provide services to us, such as data processing, marketing, customer support, and IT services.\n(B) Our business partners who work with us to provide products and services to you.\n(C) Our affiliates and subsidiaries.\n(D) Government agencies and law enforcement authorities, if required by law or regulation.\n(E) Other companies or organizations to protect and prevent crime/fraud; or\n(H) Other companies in connection with a merger, consolidation, asset sale, reorganization, financing, or acquisition of all or part of our business, where we are a party to such transaction.", "article numbers": "6(1)(f)", "legal provisions": "Legitimate interests"}, {"section": "5.3 Before sharing your personal data with third parties as described in Section 5.2 of this Privacy Policy, we will ensure that such third party undertakes confidentiality obligations.", "article numbers": "28", "legal provisions": "Processor"}, {"section": "5.4 We may share your personal data with anyone other than those described in Section 5.2 of this Privacy Policy. In such cases, we will notify you in advance and obtain your consent if required by applicable law.", "article numbers": "6(1)(a)", "legal provisions": "Consent"}, {"section": "5.5 We will not sell your personal data to any third party and guarantee that we will only use personal data in a reasonable and lawful manner to the extent permitted by law.", "article numbers": "6(1)(f)", "legal provisions": "Legitimate interests"}, {"section": "6.1 We are a multinational company and our business operates in multiple countries around the world. As such, we collect and transfer personal data globally. This means that we may transfer your personal data to locations outside of your country. We will ensure that such transfers of your personal data are governed by this Privacy Policy and comply with applicable law. For example, where required by applicable law, we will ensure that personal data transferred to locations outside of your country will be protected by standards that are equivalent to those under that law, and we will require overseas data recipients to make similar commitments.", "article numbers": "44-49", "legal provisions": "Transfers of personal data to third countries or international organizations"}, {"section": "6.2 For more information, please contact us using the \"Contact Us\" section below.", "article numbers": "13, 14", "legal provisions": "Information to be provided where personal data are collected from the data subject"}], "non_compliant": [{"section": "5.2 We may share your personal data with third parties, including but not limited to:\n(A) Our service providers who provide services to us, such as data processing, marketing, customer support, and IT services.\n(B) Our business partners who work with us to provide products and services to you.\n(C) Our affiliates and subsidiaries.\n(D) Government agencies and law enforcement authorities, if required by law or regulation.\n(E) Other companies or organizations to protect and prevent crime/fraud; or\n(H) Other companies in connection with a merger, consolidation, asset sale, reorganization, financing, or acquisition of all or part of our business, where we are a party to such transaction.", "article numbers": "6(1)(f)", "legal provisions": "Legitimate interests", "amend": "The policy should specify the legitimate interests pursued by the company in sharing data with third parties. It should also include a Data Protection Impact Assessment (DPIA) for high-risk data processing activities."}, {"section": "5.4 We may share your personal data with anyone other than those described in Section 5.2 of this Privacy Policy. In such cases, we will notify you in advance and obtain your consent if required by applicable law.", "article numbers": "6(1)(a)", "legal provisions": "Consent", "amend": "The policy should specify the circumstances under which consent is required and how it is obtained. It should also include information about the right to withdraw consent."}, {"section": "6.1 We are a multinational company and our business operates in multiple countries around the world. As such, we collect and transfer personal data globally. This means that we may transfer your personal data to locations outside of your country. We will ensure that such transfers of your personal data are governed by this Privacy Policy and comply with applicable law. For example, where required by applicable law, we will ensure that personal data transferred to locations outside of your country will be protected by standards that are equivalent to those under that law, and we will require overseas data recipients to make similar commitments.", "article numbers": "44-49", "legal provisions": "Transfers of personal data to third countries or international organizations", "amend": "The policy should specify the mechanisms used to ensure adequate protection of personal data transferred to third countries, such as standard contractual clauses, binding corporate rules, or certification mechanisms."}]}
