{"compliant": [{"section": "Opt Out From Receiving Communications", "article numbers": "Article 21", "legal provisions": "Right to object to processing based on legitimate interests or public interest"}, {"section": "Change Your Information", "article numbers": "Article 16", "legal provisions": "Right to rectification"}, {"section": "Delete Your Information", "article numbers": "Article 17", "legal provisions": "Right to erasure (right to be forgotten)"}], "non_compliant": [{"section": "Opt Out From Receiving Communications", "article numbers": "Article 13", "legal provisions": "Information to be provided where personal data are collected from the data subject", "amend": "The policy should explicitly state the legal basis for processing personal data for marketing purposes, such as consent or legitimate interest. It should also clearly explain how individuals can withdraw their consent to receive marketing communications."}, {"section": "Change Your Information", "article numbers": "Article 15", "legal provisions": "Right of access by the data subject", "amend": "The policy should provide a clear and accessible method for individuals to access their personal data. It should also specify the timeframe within which the request will be fulfilled."}, {"section": "Delete Your Information", "article numbers": "Article 17", "legal provisions": "Right to erasure (right to be forgotten)", "amend": "The policy should provide a clear and accessible method for individuals to request the deletion of their personal data. It should also specify the timeframe within which the request will be fulfilled. The policy should also clearly explain the exceptions to the right to erasure, such as when data is necessary for legal obligations or public interest."}, {"section": "Payment Processing", "article numbers": "Article 28", "legal provisions": "Processor", "amend": "The policy should clearly state the responsibilities of the payment processors in relation to data protection. It should also ensure that the payment processors are bound by appropriate contractual arrangements that comply with GDPR."}]}
