{"compliant": [{"section": "You may be required to sign up for an account, and select a password and user name (“IFTTT User ID”). As a condition to using the Service or in order to create certain statements through the Service, you may be required to supply IFTTT with certain registration information, including a valid email address, registration information for mobile phones, other mobile devices, or third-party sites or services you access through IFTTT.", "article numbers": "6, 9, 14", "legal provisions": "Right to access, Right to rectification, Right to erasure"}, {"section": "You promise to provide us with accurate, complete, and updated registration information about yourself.", "article numbers": "5, 6", "legal provisions": "Data minimization, Accuracy"}, {"section": "You may not (i) select or use as your username a name of another person with the intent to impersonate that person; or (ii) use as your username a name subject to any rights of a person other than you without appropriate authorization; or (iii) use as your username a name that is otherwise offensive, vulgar or obscene.", "article numbers": "6, 17", "legal provisions": "Accuracy, Integrity and confidentiality"}, {"section": "IFTTT reserves the right to refuse registration of, or cancel a username in its discretion.", "article numbers": "17", "legal provisions": "Integrity and confidentiality"}, {"section": "You shall not use another user's account or any other person's registration information for the Service, any other mobile phones or other mobile devices, or any third party services you access through the Service, without that person's permission.", "article numbers": "6, 17", "legal provisions": "Accuracy, Integrity and confidentiality"}, {"section": "Your right to use the Service continues until it is terminated by either party.", "article numbers": "17", "legal provisions": "Integrity and confidentiality"}, {"section": "You may terminate by discontinuing use of the Service.", "article numbers": "17", "legal provisions": "Integrity and confidentiality"}, {"section": "IFTTT may terminate at any time for any reason.", "article numbers": "17", "legal provisions": "Integrity and confidentiality"}, {"section": "Your use terminates automatically if (i) you violate any term of these Terms, (ii) IFTTT publicly posts a written notice of termination on the Service, (iii) IFTTT sends a written notice of termination to you, or (iv) IFTTT ceases providing access to the Service to you.", "article numbers": "17", "legal provisions": "Integrity and confidentiality"}, {"section": "IFTTT will use reasonable efforts to ensure that the Service is available twenty-four hours a day, seven days a week.", "article numbers": "5, 25", "legal provisions": "Data minimization, Purpose limitation"}, {"section": "However, there will be occasions when the Service will be interrupted for maintenance, upgrades and emergency repairs.", "article numbers": "5, 25", "legal provisions": "Data minimization, Purpose limitation"}, {"section": "Every reasonable step will be taken by IFTTT to minimize such disruption where it is within IFTTT's reasonable control.", "article numbers": "5, 25", "legal provisions": "Data minimization, Purpose limitation"}, {"section": "You agree that IFTTT will not be liable in any event to you or any other party for any suspension, modification, discontinuance or lack of availability of the Service.", "article numbers": "5, 25", "legal provisions": "Data minimization, Purpose limitation"}, {"section": "You shall be responsible for obtaining and maintaining any equipment or ancillary services needed to connect to, access or otherwise use the Service, including, without limitation, mobile phones, modems, hardware, software, data plans, and long distance or local telephone service.", "article numbers": "5, 25", "legal provisions": "Data minimization, Purpose limitation"}, {"section": "You shall be responsible for ensuring that such equipment or ancillary services are compatible with the Service.", "article numbers": "5, 25", "legal provisions": "Data minimization, Purpose limitation"}, {"section": "The materials displayed or performed or available on or through the Service, including, but not limited to, text, graphics, data, articles, photos, images, illustrations, User Submissions (defined below), and so forth (all of the foregoing, the “Content”) are protected by copyright and/or other intellectual property laws.", "article numbers": "13, 17", "legal provisions": "Right to object, Integrity and confidentiality"}], "non_compliant": [{"section": "We reserve the right to change the Terms at any time, but if we do, we will bring it to your attention by placing a notice on ifttt . com website, by sending you an email, and/or by some other means.", "article numbers": "13, 17", "legal provisions": "Right to object, Integrity and confidentiality", "amend": "The policy should clearly state the process for informing users about changes to the Terms, including the specific methods used to notify users and the timeframe for providing such notification. It should also ensure that users have the opportunity to object to the changes and withdraw their consent if they are not satisfied with the new terms."}]}
