{"compliant": [{"section": "5.3 If Customer believes that Company has billed Customer incorrectly, Customer must contact Company no later than sixty (60) days after the closing date on the first billing statement in which the error or problem appeared, in order to receive an adjustment or credit.", "article numbers": "15", "legal provisions": "Right to rectification"}], "non_compliant": [{"section": "4 . INTELLECTUAL PROPERTY RIGHTS Except as expressly set forth herein, Company alone (and its licensors, where applicable) will retain all intellectual property rights relating to the Platform . If, in the course of performing under this Agreement, Customer provides Company with any written comments, suggestions, or feedback regarding the Platform (“Feedback”), Customer hereby grants Company a non-exclusive, worldwide, royalty-free license to use and disclose the Feedback in any manner Company chooses and, directly or indirectly through third parties, to display, perform, copy, have copied, make, have made, use, sell, offer to sell, and otherwise dispose of Company’s products and services (including any improvements or modifications thereof) embodying the Feedback in any manner and via any media the Company chooses, but without reference to you as the source of the Feedback .", "article numbers": "6, 13, 14, 15, 25", "legal provisions": "Lawfulness, fairness and transparency, Purpose limitation, Data minimisation, Accuracy, Storage limitation, Integrity and confidentiality, Accountability", "amend": "The company should obtain explicit consent from the customer for the processing of their feedback, specifying the purpose of processing, the types of data processed, and the duration of storage. The company should also ensure that the customer has the right to access, rectify, erase, restrict, and object to the processing of their data. The company should also ensure that the customer is informed about their rights and how to exercise them."}, {"section": "5 . 2 Unpaid Fees are subject to a finance charge of 1 . 5% per month on any outstanding balance, or the maximum permitted by law, whichever is lower, plus all expenses of collection . Customer shall be responsible for all taxes associated with Platform other than U . S . taxes based on Company’s net income .", "article numbers": "6, 13, 14, 15, 25", "legal provisions": "Lawfulness, fairness and transparency, Purpose limitation, Data minimisation, Accuracy, Storage limitation, Integrity and confidentiality, Accountability", "amend": "The company should obtain explicit consent from the customer for the processing of their financial data, specifying the purpose of processing, the types of data processed, and the duration of storage. The company should also ensure that the customer has the right to access, rectify, erase, restrict, and object to the processing of their data. The company should also ensure that the customer is informed about their rights and how to exercise them."}, {"section": "6 . 1 Your right to use the Developer Tool and Service continues until expiration of your license term or it is terminated by either Party as detailed below . You may terminate this Agreement by discontinuing use of all or any of the Developer Tool or Service . We may immediately terminate your use of and access to the Developer Tool and Service if you violate any term of this Agreement . Sections 2, 3, 4 (to the extent Fees remain unpaid), 5, 9, and 13 through 17 shall survive termination .", "article numbers": "17, 21", "legal provisions": "Right to erasure, Right to object", "amend": "The company should provide clear and concise information about the data processing activities related to the Developer Tool and Service, including the purpose of processing, the types of data processed, the duration of storage, and the customer's rights. The company should also ensure that the customer has the right to access, rectify, erase, restrict, and object to the processing of their data. The company should also ensure that the customer is informed about their rights and how to exercise them."}, {"section": "6 . 2 In addition to any other remedies it may have, either party may also terminate this Agreement upon thirty (30) days’ notice (or ten (10) days in the case of nonpayment), if the other party breaches any of the terms or conditions of this Agreement . Either party may terminate this Agreement, without notice, (i) upon the institution by or against the other party of insolvency, receivership or bankruptcy proceedings, (ii) upon the other party's making an assignment for the benefit of creditors, or (iii) upon the other party's dissolution or ceasing to do business .", "article numbers": "17, 21", "legal provisions": "Right to erasure, Right to object", "amend": "The company should provide clear and concise information about the data processing activities related to the termination of the Agreement, including the purpose of processing, the types of data processed, the duration of storage, and the customer's rights. The company should also ensure that the customer has the right to access, rectify, erase, restrict, and object to the processing of their data. The company should also ensure that the customer is informed about their rights and how to exercise them."}]}
