{"compliant": [{"section": "This Zapier Privacy Statement (“Privacy Statement”) describes how Zapier, Inc. and our affiliated entities collect, use, process, and share your personally identifiable information.", "article numbers": "Art. 13, Art. 14", "legal provisions": "Transparency, purpose limitation, data minimization"}, {"section": "This Statement describes your choices regarding any applicable rights of access, deletion, and correction of your personal information.", "article numbers": "Art. 15, Art. 16, Art. 17", "legal provisions": "Right to access, right to rectification, right to erasure"}, {"section": "Where we refer to “information” in this Privacy Statement, it means any information that relates to an identified person.", "article numbers": "Art. 4", "legal provisions": "Definition of personal data"}, {"section": "This Privacy Statement applies to zapier.com, community.zapier.com and experts.zapier.com/, and any other website that links to this Statement (the “Site”).", "article numbers": "Art. 12", "legal provisions": "Transparency, information"}, {"section": "This Privacy Statement also applies to the information that we collect through the services we offer or our developer programs (the Zapier developer platform and the Zapier services, we refer to as “Services”), communities, through marketing and customer engagement, branded social media pages.", "article numbers": "Art. 13, Art. 14", "legal provisions": "Transparency, purpose limitation, data minimization"}, {"section": "This Privacy Statement does not apply to the information we collect about employees (our employment policies apply) or job applicants (our Applicant Privacy Statement applies).", "article numbers": "Art. 13, Art. 14", "legal provisions": "Transparency, purpose limitation, data minimization"}, {"section": "This Privacy Statement also does not apply to information collected by third parties, like third-party websites, social media platforms or accounts, third-party service providers, or other third-party services or applications that integrate with our Services.", "article numbers": "Art. 13, Art. 14", "legal provisions": "Transparency, purpose limitation, data minimization"}, {"section": "This Privacy Statement also does not apply to any information that is not personally identifiable, like aggregated or anonymous information.", "article numbers": "Art. 4", "legal provisions": "Definition of personal data"}, {"section": "We may update this Privacy Statement from time to time and provide notice to you as described below in the section titled “Notice of Changes.”", "article numbers": "Art. 13, Art. 14", "legal provisions": "Transparency, purpose limitation, data minimization"}, {"section": "Our Services are not directed at children under the age of 16, and we do not knowingly collect information from individuals under the age of 16.", "article numbers": "Art. 8", "legal provisions": "Protection of children"}, {"section": "If you are under the age of 16, you may not use the Services or provide your information to us through the Site or otherwise.", "article numbers": "Art. 8", "legal provisions": "Protection of children"}, {"section": "If you are a citizen of Switzerland, the United Kingdom, or a country in the European Economic Area, we describe additional rights you may have in the European Privacy Rights statement.", "article numbers": "Art. 13, Art. 14", "legal provisions": "Transparency, purpose limitation, data minimization"}, {"section": "If you are a California resident, we describe additional rights you may have in the California Privacy Rights statement.", "article numbers": "Art. 13, Art. 14", "legal provisions": "Transparency, purpose limitation, data minimization"}, {"section": "We collect or receive information in the ways we describe in this section.", "article numbers": "Art. 13, Art. 14", "legal provisions": "Transparency, purpose limitation, data minimization"}, {"section": "Information You Provide Us: When you sign up to create an account in the Service, download content from the Site, fill out a form or survey or respond to communications, you provide us with information like your name, email address, address, company, phone number or other information.", "article numbers": "Art. 13, Art. 14", "legal provisions": "Transparency, purpose limitation, data minimization"}], "non_compliant": []}
