{"compliant": [{"section": "Zapier has certified to the U.S. Department of Commerce that it adheres to: (1) the EU-U.S. Data Privacy Framework Principles (EU-U.S. DPF Principles) with regard to the processing of personal data received from the European Union in reliance on the EU-U.S. DPF; 2) the Swiss-U.S. Data Privacy Framework Principles (Swiss-U.S. DPF Principles) with regard to the processing of personal data received from Switzerland in reliance on the Swiss-U.S. DPF; and (3) the UK Extension with regard to the processing of personal data received from the UK in reliance on the UK Extension.", "article numbers": "Art. 44, Art. 45, Art. 46", "legal provisions": "Adequacy decision, appropriate safeguards, binding corporate rules"}, {"section": "If there is any conflict between the terms in this privacy policy and the EU-U.S. DPF Principles, the Swiss-U.S. DPF Principles or the UK Extension, the Principles shall govern.", "article numbers": "Art. 4(1), Art. 4(2), Art. 4(3)", "legal provisions": "Definitions, legal basis for processing, data protection principles"}, {"section": "In cases of onward transfer of personal information to third parties of data of EU, Swiss and UK individuals received pursuant to the EU-U.S. DPF, the Swiss-U.S DPF and the UK Extension, and in a manner inconsistent with the DPF Principals, Zapier will remain liable.", "article numbers": "Art. 28", "legal provisions": "Processor, data protection principles"}, {"section": "Any disputes arising out of or related to this Privacy Statement will be handled in accordance with the dispute resolution process indicated in your contract with Zapier that refers to this Privacy Statement, if applicable.", "article numbers": "Art. 77", "legal provisions": "Right to lodge a complaint with a supervisory authority"}, {"section": "In compliance with the EU-U.S. DPF, the Swiss-U.S. DPF, and the UK Extension, Zapier commits to refer unresolved complaints concerning our handling of personal data received in reliance on the EU-U.S. DPF, the Swiss-U.S. DPF and the UK Extension to JAMS, an alternative dispute resolution provider based in the United States.", "article numbers": "Art. 77", "legal provisions": "Right to lodge a complaint with a supervisory authority"}], "non_compliant": [{"section": "To learn more about the Data Privacy Framework (DPF) Program, and to view our certification, please visit https://www.dataprivacyframework.gov/", "article numbers": "Art. 13, Art. 14", "legal provisions": "Information to be provided where personal data are collected from the data subject, Information to be provided where personal data are not collected from the data subject", "amend": "Provide more detailed information about the data processing activities, including the purposes, legal basis, recipients, and retention periods"}, {"section": "You may direct any questions or complaints about this Privacy Statement to us by contacting us through the channels indicated below.", "article numbers": "Art. 12, Art. 15, Art. 16, Art. 17, Art. 18, Art. 19, Art. 20, Art. 21", "legal provisions": "Right to information, Right of access, Right to rectification, Right to erasure ('right to be forgotten'), Right to restriction of processing, Right to data portability, Right to object", "amend": "Provide clear and concise information about the data subject's rights, including how to exercise them"}, {"section": "In the case of our customers or their users, that means our Terms of Service or users of our developer platform, the Zapier Platform Agreement.", "article numbers": "Art. 13, Art. 14", "legal provisions": "Information to be provided where personal data are collected from the data subject, Information to be provided where personal data are not collected from the data subject", "amend": "Provide more detailed information about the data processing activities, including the purposes, legal basis, recipients, and retention periods"}, {"section": "In the case of visitors to the Site, that means our Website Terms of Use.", "article numbers": "Art. 13, Art. 14", "legal provisions": "Information to be provided where personal data are collected from the data subject, Information to be provided where personal data are not collected from the data subject", "amend": "Provide more detailed information about the data processing activities, including the purposes, legal basis, recipients, and retention periods"}]}
