{"compliant": [{"section": "自我保護", "article numbers": "Art. 5(1)(a), Art. 5(1)(b), Art. 5(1)(c), Art. 5(1)(d), Art. 5(1)(e), Art. 5(1)(f), Art. 32", "legal provisions": "Data Minimization, Purpose Limitation, Accuracy, Storage Limitation, Integrity and Confidentiality, Lawfulness, Processing Security"}, {"section": "修訂之權利", "article numbers": "Art. 13(2)(f), Art. 14(2)(f)", "legal provisions": "Transparency, Information about rectification or erasure"}, {"section": "準據法及管轄法院", "article numbers": "Art. 6(1)(c), Art. 77", "legal provisions": "Legitimate Interests, Right to Effective Judicial Remedy"}], "non_compliant": [{"section": "自我保護", "article numbers": "Art. 13(1)(a), Art. 13(1)(b), Art. 13(1)(c), Art. 13(1)(d), Art. 13(1)(e), Art. 13(1)(f), Art. 13(1)(g), Art. 13(1)(h), Art. 13(2)(a), Art. 13(2)(b), Art. 13(2)(c), Art. 13(2)(d), Art. 13(2)(e), Art. 14(1)(a), Art. 14(1)(b), Art. 14(1)(c), Art. 14(1)(d), Art. 14(1)(e), Art. 14(1)(f), Art. 14(1)(g), Art. 14(1)(h), Art. 14(2)(a), Art. 14(2)(b), Art. 14(2)(c), Art. 14(2)(d), Art. 14(2)(e)", "legal provisions": "Information to be provided to the data subject, Information to be provided to the data subject in case of rectification or erasure, Information to be provided to the data subject in case of restriction of processing, Information to be provided to the data subject in case of objection to processing, Information to be provided to the data subject in case of automated individual decision-making, Information to be provided to the data subject in case of transfer of personal data to a third country or an international organization, Information to be provided to the data subject in case of profiling, Information to be provided to the data subject in case of data breach, Information to be provided to the data subject in case of rectification or erasure, Information to be provided to the data subject in case of restriction of processing, Information to be provided to the data subject in case of objection to processing, Information to be provided to the data subject in case of automated individual decision-making, Information to be provided to the data subject in case of transfer of personal data to a third country or an international organization, Information to be provided to the data subject in case of profiling, Information to be provided to the data subject in case of data breach, Information to be provided to the data subject in case of rectification or erasure, Information to be provided to the data subject in case of restriction of processing, Information to be provided to the data subject in case of objection to processing, Information to be provided to the data subject in case of automated individual decision-making, Information to be provided to the data subject in case of transfer of personal data to a third country or an international organization, Information to be provided to the data subject in case of profiling, Information to be provided to the data subject in case of data breach", "amend": "The policy should explicitly state the information required by GDPR, including the identity and contact details of the controller, the purposes of processing, the legal basis for processing, the recipients of the data, the retention period, the rights of the data subject, and the contact details of the data protection officer."}, {"section": "修訂之權利", "article numbers": "Art. 13(2)(f), Art. 14(2)(f)", "legal provisions": "Transparency, Information about rectification or erasure", "amend": "The policy should specify the method of communication for notifying data subjects of changes to the privacy policy."}, {"section": "準據法及管轄法院", "article numbers": "Art. 45, Art. 46", "legal provisions": "Transfers of personal data to third countries or international organisations, Transfers subject to appropriate safeguards", "amend": "The policy should provide more details about the safeguards in place for transferring personal data to third countries or international organizations."}]}
