{"compliant": [{"section": "This Zapier Privacy Statement (\"Privacy Statement\") describes how Zapier, Inc. and our affiliated entities collect, use, process, and share your personally identifiable information.", "article numbers": "Art. 13, Art. 14", "legal provisions": "Transparency, purpose limitation, data minimization"}, {"section": "This Statement describes your choices regarding any applicable rights of access, deletion, and correction of your personal information.", "article numbers": "Art. 15, Art. 16, Art. 17", "legal provisions": "Right to access, right to rectification, right to erasure"}, {"section": "Where we refer to \"information\" in this Privacy Statement, it means any information that relates to an identified person.", "article numbers": "Art. 4", "legal provisions": "Definition of personal data"}, {"section": "This Privacy Statement applies to zapier.com, community.zapier.com and experts.zapier.com/, and any other website that links to this Statement (the \"Site\").", "article numbers": "Art. 12", "legal provisions": "Transparency, information"}, {"section": "This Privacy Statement also applies to the information that we collect through the services we offer or our developer programs (the Zapier developer platform and the Zapier services, we refer to as \"Services\"), communities, through marketing and customer engagement, branded social media pages.", "article numbers": "Art. 13, Art. 14", "legal provisions": "Transparency, purpose limitation, data minimization"}, {"section": "This Privacy Statement does not apply to the information we collect about employees (our employment policies apply) or job applicants (our Applicant Privacy Statement applies).", "article numbers": "Art. 13, Art. 14", "legal provisions": "Transparency, purpose limitation, data minimization"}, {"section": "This Privacy Statement also does not apply to information collected by third parties, like third-party websites, social media platforms or accounts, third-party service providers, or other third-party services or applications that integrate with our Services.", "article numbers": "Art. 13, Art. 14", "legal provisions": "Transparency, purpose limitation, data minimization"}, {"section": "This Privacy Statement also does not apply to any information that is not personally identifiable, like aggregated or anonymous information.", "article numbers": "Art. 4", "legal provisions": "Definition of personal data"}, {"section": "We may update this Privacy Statement from time to time and provide notice to you as described below in the section titled \"Notice of Changes.\"", "article numbers": "Art. 13, Art. 14", "legal provisions": "Transparency, purpose limitation, data minimization"}, {"section": "Our Services are not directed at children under the age of 16, and we do not knowingly collect information from individuals under the age of 16.", "article numbers": "Art. 8", "legal provisions": "Protection of children"}, {"section": "If you are under the age of 16, you may not use the Services or provide your information to us through the Site or otherwise.", "article numbers": "Art. 8", "legal provisions": "Protection of children"}, {"section": "If you are a citizen of Switzerland, the United Kingdom, or a country in the European Economic Area, we describe additional rights you may have in the European Privacy Rights statement.", "article numbers": "Art. 13, Art. 14", "legal provisions": "Transparency, purpose limitation, data minimization"}, {"section": "If you are a California resident, we describe additional rights you may have in the California Privacy Rights statement.", "article numbers": "Art. 13, Art. 14", "legal provisions": "Transparency, purpose limitation, data minimization"}, {"section": "We collect or receive information in the ways we describe in this section.", "article numbers": "Art. 13, Art. 14", "legal provisions": "Transparency, purpose limitation, data minimization"}, {"section": "Information You Provide Us: When you sign up to create an account in the Service, download content from the Site, fill out a form or survey or respond to communications, you provide us with information like your name, email address, address, company, phone number or other information.", "article numbers": "Art. 13, Art. 14", "legal provisions": "Transparency, purpose limitation, data minimization"}, {"section": "When you register for a community or a partner program, we collect account registration information like your name, email address, address, company, phone number, or other information . You may provide comments, communications, feedback, ratings, or other information when you use the Services or any of our communities or partner programs .", "article numbers": "Art. 6(1)(a), Art. 6(1)(b), Art. 6(1)(f)", "legal provisions": "Consent, Contractual necessity, Legitimate interest"}, {"section": "When You Create an Account: When you create an account, you provide us with your account registration and profile information (name, email address, company, and similar information) . We automatically track certain information about your use of the Services, partner programs, or communities . We collect information about you when you login and how you interact with the Services, the features you use, clicks, log information about your use of the Services, and how you interact with other users .", "article numbers": "Art. 6(1)(a), Art. 6(1)(b), Art. 6(1)(f)", "legal provisions": "Consent, Contractual necessity, Legitimate interest"}, {"section": "We describe the information we collect through the Services in more detail in Zapier Services statement . Content or Information You Provide in the Services: The Services allow you to create connections or integrations between the third-party applications you use . When you use the Services, information or content is transferred from one application to another application .", "article numbers": "Art. 6(1)(a), Art. 6(1)(b), Art. 6(1)(f)", "legal provisions": "Consent, Contractual necessity, Legitimate interest"}, {"section": "We collect the information that is transferred between the third-party applications . We describe the information we collect through your use of the Services in more detail in the Zapier Services statement . Other users may provide information about individuals when they submit content or information through the Services .", "article numbers": "Art. 6(1)(a), Art. 6(1)(b), Art. 6(1)(f)", "legal provisions": "Consent, Contractual necessity, Legitimate interest"}, {"section": "For example, if a user sets up a Zap that allows automated calendaring, that user will share information about the individuals they schedule meetings with via the Zap . Users may also provide information about their teammates, including name and email address, to invite teammates to use the Services .", "article numbers": "Art. 6(1)(a), Art. 6(1)(b), Art. 6(1)(f)", "legal provisions": "Consent, Contractual necessity, Legitimate interest"}, {"section": "Similarly, an administrator may provide your contact information if they designate you as a user, the billing contact, technical contact, or administrator . You or your administrator may integrate the Services with third-party applications . In such case, we will receive information that allows us to identify your account within the third-party applications (like name, email address, phone number, tokens, or other identifying information), the log data, content, and device information .", "article numbers": "Art. 6(1)(a), Art. 6(1)(b), Art. 6(1)(f)", "legal provisions": "Consent, Contractual necessity, Legitimate interest"}, {"section": "The information or content we receive from your organization is subject to your organization’s privacy policies . When you integrate our Services with a third-party application, the information we receive depends on the settings, permissions, and privacy Statement controlled by that third-party application . Content You Provide Through Our Site: If the Site or our social media platform pages allow you to upload content or information, we will collect the content or information you upload .", "article numbers": "Art. 6(1)(a), Art. 6(1)(b), Art. 6(1)(f)", "legal provisions": "Consent, Contractual necessity, Legitimate interest"}, {"section": "For example, when you provide feedback, participate in any interactive features, surveys, contests, promotions, sweepstakes, activities, or events, you may provide us information or content . Information You Provide Through Support Channels or Communities: You may provide information or content to us through the customer support or chat functionality we make available on the Site, in the Services, or other sites that we control .", "article numbers": "Art. 6(1)(a), Art. 6(1)(b), Art. 6(1)(f)", "legal provisions": "Consent, Contractual necessity, Legitimate interest"}, {"section": "When you engage with our support team, in addition to your account information, we may ask you to provide additional information about your issue, which may include information about your technology, software, internet connection, or screenshots .", "article numbers": "6(1)", "legal provisions": "Lawfulness, fairness and transparency"}, {"section": "To submit information to a community site, we may require you to create an account within the community (we will collect your account registration information like name, email, company, address, and phone number) .", "article numbers": "6(1)", "legal provisions": "Lawfulness, fairness and transparency"}, {"section": "If you have an account in the Services, we will associate your community membership and activities with your Services account .", "article numbers": "6(1)", "legal provisions": "Lawfulness, fairness and transparency"}, {"section": "As a community member, you and other members may submit questions, provide answers, engage with members through chat or comments, create content or webinars to share with the community, or solicit feedback or help from other community members .", "article numbers": "6(1)", "legal provisions": "Lawfulness, fairness and transparency"}, {"section": "Marketing Information: We receive information about you directly from you when you engage with the Site and automatically when you engage with the Site or open or click the emails we send you (See Information You Provide Us and Cookies and Other Tracking Technology) .", "article numbers": "6(1)", "legal provisions": "Lawfulness, fairness and transparency"}, {"section": "We receive information from third-party sources like lead generation providers, content sponsors, event sponsors, or social media platforms .", "article numbers": "6(1)", "legal provisions": "Lawfulness, fairness and transparency"}, {"section": "The information we collect from third-party sources may include marketing or demographic information, contact information (name, email, company, address, job title), information about your profile on those platforms, or information about purchasing intent .", "article numbers": "6(1)", "legal provisions": "Lawfulness, fairness and transparency"}, {"section": "We may combine this information with the information we collect .", "article numbers": "6(1)", "legal provisions": "Lawfulness, fairness and transparency"}, {"section": "Partner Programs: We have several partner programs that we make available: our developer platform program (which allows third-party application providers to build integrations to Zapier) and our expert program (which connects experts who help our customers set up and use the Services) .", "article numbers": "6(1)", "legal provisions": "Lawfulness, fairness and transparency"}, {"section": "Partners may also help us to market and promote our Services, generate leads, or they may resell our Services .", "article numbers": "6(1)", "legal provisions": "Lawfulness, fairness and transparency"}, {"section": "We may add partner programs in the future .", "article numbers": "6(1)", "legal provisions": "Lawfulness, fairness and transparency"}, {"section": "Through partner programs, we collect account registration information (like name, email address, company, and phone number), information about an individual’s technical skill set, comments, questions or feedback, rating or ranking information, images, content, or other information you provide .", "article numbers": "6(1)", "legal provisions": "Lawfulness, fairness and transparency"}, {"section": "We may also receive information from our partners (like business contact information, address, job title, email address, or phone number) .", "article numbers": "6(1)", "legal provisions": "Lawfulness, fairness and transparency"}, {"section": "We will combine the information you provide and the information we receive with your account information .", "article numbers": "6(1)", "legal provisions": "Lawfulness, fairness and transparency"}, {"section": "Payment Processing Information: When you create a paid account within the Services or otherwise initiate a transaction with us, we will use a third-party payment processor to process the payment .", "article numbers": "6(1)", "legal provisions": "Lawfulness, fairness and transparency"}, {"section": "We do not collect your credit card number, expiration date, or pin number .", "article numbers": "6(1)", "legal provisions": "Lawfulness, fairness and transparency"}, {"section": "The transaction details we retain are those details that allow us to verify that you paid for the Services or transaction, including price, currency, date of payment, payment method, name, and account name .", "article numbers": "6(1)", "legal provisions": "Lawfulness, fairness and transparency"}, {"section": "We will combine that information with your account information .", "article numbers": "6(1)", "legal provisions": "Lawfulness, fairness and transparency"}, {"section": "Technical, Device, and Connection Information: When you use the Services or interact with our Site, we automatically collect information about the device you use to access the Site or Services .", "article numbers": "6(1)", "legal provisions": "Lawfulness, fairness and transparency"}, {"section": "When you interact with our branded social media sites, the social media platform automatically collects information and provides it to us . This information includes information that identifies you and connection type, settings, operating system, browser type, internet protocol (IP) address, URLs of referring/exit pages, device identifiers, and crash data .", "article numbers": "13, 14", "legal provisions": "Right to be informed, Right to access"}, {"section": "Cookies and Other Tracking Technology: We use cookies, web beacons, pixels, or other tracking technology on the Site and in the Services to provide functionality, personalize your experience and recognize you across services or devices . This information includes IP addresses, location, device type, browser type, internet service provider (ISP), referring/exit pages, operating system, date/time stamp, click data, device-identifying data .", "article numbers": "13, 14", "legal provisions": "Right to be informed, Right to access"}, {"section": "We may combine this automatically collected information with other information that you provide us through other channels . You can learn more about our cookies in the Cookie Notice statement . When you interact with our social media sites, the social media platform automatically collects information and provides it to us .", "article numbers": "13, 14", "legal provisions": "Right to be informed, Right to access"}, {"section": "Other Information Sources: We receive information about you from other sources like third-party service providers, public databases, and our business and channel partners . This information may include business contact information, address, job title, email address, phone number . We may combine this information with information we collect through other means .", "article numbers": "13, 14", "legal provisions": "Right to be informed, Right to access"}, {"section": "How We Use Personal Information We Collect We use the information we collect for the following purposes: to provide and support the Services, to improve the Services, to provide, support, and improve the Site, our partner programs, or communities, to process your requests, to process your payments or transactions, to provide you with information about our products and services, to combine information about you with other information we receive from third parties, to tailor the content or information that we provide to you, to protect the integrity or security of our business, the Site, Services, or third-party applications, or we may also use your information to: carry out our obligations, enforce our rights, comply with any legal obligation (including assisting our customer to comply with their legal obligations), where it is necessary for our legitimate interests, or to fulfill any other purpose for which you provided the information .", "article numbers": "5, 6", "legal provisions": "Lawful basis for processing, Legitimate interests"}, {"section": "How We Share Personal Information We may share information when one of the following circumstances applies: With your Consent: We may share your information with companies, organizations, and other third parties with your consent or to fulfill the purpose for which you provided the information .", "article numbers": "6, 7", "legal provisions": "Lawful basis for processing, Right to rectification"}, {"section": "With our Partners: We may share information with our partners (including resellers, referral, integration partners, experts in our community, or developer platform partners) for the purposes of the partnership agreement or to enable our partner programs .", "article numbers": "6, 7", "legal provisions": "Lawful basis for processing, Right to rectification"}, {"section": "To Provide the Services, Partner Programs, or Communities: We may share your information with your teammates, account administrators, billing, or technical account users . We will also share your information with third-party applications (at your direction or the direction of an account owner) when an account holder uses the Services .", "article numbers": "6, 7", "legal provisions": "Lawful basis for processing, Right to rectification"}, {"section": "To deliver the Site, Services, partner programs, or communities, we may share your information with our service providers .", "article numbers": "6, 7", "legal provisions": "Lawful basis for processing, Right to rectification"}, {"section": "If you participate in our partner programs or communities, we may share your information with other partners, community members, customers, or other users (like when you comment or share information, rate an expert, or express interest in a partner integration) .", "article numbers": "6(1)", "legal provisions": "Lawfulness of processing"}, {"section": "For Business Purposes: We provide information to vendors and services providers to help us provide the Site, Services, partner programs and communities, and for our business purposes .", "article numbers": "6(1)(f)", "legal provisions": "Legitimate interests"}, {"section": "Examples of our service providers include hosting or infrastructure providers, chat widgets, helpdesk ticket providers, website hosts, customer relationship management providers, email providers, collaboration tools, and other service providers .", "article numbers": "6(1)(f)", "legal provisions": "Legitimate interests"}, {"section": "To Market our Services or Partner Programs: We may share information that you provide us with third-party service providers who help us market our Services or our partner programs .", "article numbers": "6(1)(f)", "legal provisions": "Legitimate interests"}, {"section": "These service providers may provide virtual or live events, email marketing tools, sales engagement, or lead generation tools .", "article numbers": "6(1)(f)", "legal provisions": "Legitimate interests"}, {"section": "For Corporate Transactions: We may share personal data with actual or prospective acquirers, their representatives, and other relevant participants in, or during negotiations of, any sale, merger, acquisition, restructuring, divestiture, or change in control involving all or a portion of our business or assets, including in connection with a bankruptcy or similar proceedings .", "article numbers": "6(1)(f)", "legal provisions": "Legitimate interests"}, {"section": "If we undergo a sale or corporate restructure, we may disclose information to a buyer or other successor in interest .", "article numbers": "6(1)(f)", "legal provisions": "Legitimate interests"}, {"section": "For Legal Reasons: We may share your information if we believe that it is necessary to comply with any court order, law, legal obligation, or legal process, including to respond to any government or regulatory request .", "article numbers": "6(1)(c)", "legal provisions": "Compliance with a legal obligation"}, {"section": "We may share your information if we believe that it is necessary to enforce our rights (including, without limitation, our rights under the Terms of Service, Terms of Use, Acceptable Use Statement, or the Zapier Platform Agreement), or the rights of our customers, or users .", "article numbers": "6(1)(f)", "legal provisions": "Legitimate interests"}, {"section": "We may share your information if we believe that it is necessary or appropriate to protect our rights or safety or the rights or safety of our customers, other users, partners, or service providers .", "article numbers": "6(1)(f)", "legal provisions": "Legitimate interests"}, {"section": "With Third-Party Widgets: If you click on a widget or social media feature, like the Twitter \"tweet\" button or Facebook \"like\" button, these widgets will share information with the widget provider (like IP address, the which page you are visiting on the Services and may set a cookie to enable the feature to function correctly) .", "article numbers": "6(1)(f)", "legal provisions": "Legitimate interests"}, {"section": "Your Choices - Opting Out, Correcting or Accessing Your Information Automatically Collected Information: There are various resources available to you to manage cookies . In most modern browsers, you can block or delete cookies by clicking Settings > Privacy > Cookies . Instructions for blocking or deleting cookies in other browsers may be available in each browser’s privacy or help documentation .", "article numbers": "17(1)", "legal provisions": "Right to rectification"}, {"section": "You can also disable or delete the stored data used by technology similar to cookies, such as Local Shared Objects or Flash cookies, by managing your browser’s \"add-on settings\" or visiting the website of its manufacturer .", "article numbers": "17(1)", "legal provisions": "Right to rectification"}, {"section": "To find out more about cookies, including how to see what cookies are used and stored and how to manage and delete them, visit www .", "article numbers": "15(1)", "legal provisions": "Right of access by the data subject"}, {"section": "If you disable or refuse cookies, some parts of the Site or Service may then be inaccessible or not function properly . Please see the Cookie Notice statement for more information about cookies .", "article numbers": "Article 6(1)(f)", "legal provisions": "Legitimate interests"}, {"section": "Our Marketing Activities: If you would like to opt-out of receiving our marketing, you can opt-out by sending an opt-out email to privacy@zapier . com . If we sent you a promotional email, you may opt-out by clicking the opt-out link at the bottom of the email or sending us a return email asking to be omitted from future email distributions . This-opt out does not apply to information necessary to deliver the Services, communities, or partner programs, like your account information or notices we send about the Services’ operation .", "article numbers": "Article 6(1)(a)", "legal provisions": "Consent"}, {"section": "If you have an account in the Services, you can manage your communication preferences (including opt-outs) in the settings page of your account profile .", "article numbers": "Article 17", "legal provisions": "Right to erasure"}, {"section": "Services . You can review and change your personal information in the Services by logging into the Service and visiting your account profile page .", "article numbers": "Article 15", "legal provisions": "Right of access"}, {"section": "You may also send us an email at privacy@zapier . com to request access to, correct, or delete any personal information that you have provided to us . We may not accommodate a request to change information if we believe the change would violate any law or legal requirement or cause the information to be incorrect .", "article numbers": "Article 16", "legal provisions": "Right to rectification"}, {"section": "You can manage your communication preferences within the settings page of your account profile .", "article numbers": "Article 21", "legal provisions": "Right to object"}, {"section": "Data Security and Data Transfers Data Security . Zapier takes reasonable steps to protect your personal information from loss, misuse, and unauthorized access, disclosure, alteration, or destruction, taking into account the risks involved in the processing and the nature of the personal data .", "article numbers": "Article 32", "legal provisions": "Security of processing"}, {"section": "However, no application, Internet, or email transmission is ever fully secure or error-free, and we do not guarantee the security of any personal information . You are also responsible for ensuring that your account and the passwords we provide you are protected .", "article numbers": "Article 32", "legal provisions": "Security of processing"}, {"section": "Data Storage and International Data Transfers . Information that we collect from the Site will be transferred to, and processed in the United States and in any other country where Zapier or its affiliates, subsidiaries or third party service providers maintain facilities or personnel . These countries may have data protection laws that are different to the laws of your country (and, in some cases, may not be as protective) .", "article numbers": "Article 44", "legal provisions": "Transfers of personal data to third countries or international organisations"}, {"section": "We follow applicable data protection laws when transferring personal data . If you are resident in or a visitor from the EEA, United Kingdom or Switzerland, we will protect your Personal Information when it is transferred outside of such locations by processing it in a territory which the European Commission has determined provides an adequate level of protection for Personal Information; or otherwise implementing appropriate safeguards to protect your Personal Information, including through the use of Standard Contractual Clauses or another lawful transfer mechanism approved by the European Commission .", "article numbers": "Article 46", "legal provisions": "Derogations for specific situations"}, {"section": "For data transfers and storage of information we collect from your use of the Services, please refer to the detail in the Zapier Services statement .", "article numbers": "Article 46", "legal provisions": "Derogations for specific situations"}, {"section": "Zapier has certified to the U.S. Department of Commerce that it adheres to: (1) the EU-U.S. Data Privacy Framework Principles (EU-U.S. DPF Principles) with regard to the processing of personal data received from the European Union in reliance on the EU-U.S. DPF; 2) the Swiss-U.S. Data Privacy Framework Principles (Swiss-U.S. DPF Principles) with regard to the processing of personal data received from Switzerland in reliance on the Swiss-U.S. DPF; and (3) the UK Extension with regard to the processing of personal data received from the UK in reliance on the UK Extension.", "article numbers": "Art. 44, Art. 45, Art. 46", "legal provisions": "Adequacy decision, appropriate safeguards, binding corporate rules"}, {"section": "If there is any conflict between the terms in this privacy policy and the EU-U.S. DPF Principles, the Swiss-U.S. DPF Principles or the UK Extension, the Principles shall govern.", "article numbers": "Art. 4(1), Art. 4(2), Art. 4(3)", "legal provisions": "Definitions, legal basis for processing, data protection principles"}, {"section": "In cases of onward transfer of personal information to third parties of data of EU, Swiss and UK individuals received pursuant to the EU-U.S. DPF, the Swiss-U.S DPF and the UK Extension, and in a manner inconsistent with the DPF Principals, Zapier will remain liable.", "article numbers": "Art. 28", "legal provisions": "Processor, data protection principles"}, {"section": "Any disputes arising out of or related to this Privacy Statement will be handled in accordance with the dispute resolution process indicated in your contract with Zapier that refers to this Privacy Statement, if applicable.", "article numbers": "Art. 77", "legal provisions": "Right to lodge a complaint with a supervisory authority"}, {"section": "In compliance with the EU-U.S. DPF, the Swiss-U.S. DPF, and the UK Extension, Zapier commits to refer unresolved complaints concerning our handling of personal data received in reliance on the EU-U.S. DPF, the Swiss-U.S. DPF and the UK Extension to JAMS, an alternative dispute resolution provider based in the United States.", "article numbers": "Art. 77", "legal provisions": "Right to lodge a complaint with a supervisory authority"}], "non_compliant": [{"section": "When you interact with our branded social media sites, the social media platform automatically collects information and provides it to us . This information includes information that identifies you and connection type, settings, operating system, browser type, internet protocol (IP) address, URLs of referring/exit pages, device identifiers, and crash data .", "article numbers": "15, 17", "legal provisions": "Right to restrict processing, Right to erasure", "amend": "The policy should clearly state the user's right to restrict processing and erasure of their data collected through social media platforms."}, {"section": "Cookies and Other Tracking Technology: We use cookies, web beacons, pixels, or other tracking technology on the Site and in the Services to provide functionality, personalize your experience and recognize you across services or devices . This information includes IP addresses, location, device type, browser type, internet service provider (ISP), referring/exit pages, operating system, date/time stamp, click data, device-identifying data .", "article numbers": "15, 17", "legal provisions": "Right to restrict processing, Right to erasure", "amend": "The policy should clearly state the user's right to restrict processing and erasure of their data collected through cookies and other tracking technologies."}, {"section": "We may combine this automatically collected information with other information that you provide us through other channels . You can learn more about our cookies in the Cookie Notice statement . When you interact with our social media sites, the social media platform automatically collects information and provides it to us .", "article numbers": "15, 17", "legal provisions": "Right to restrict processing, Right to erasure", "amend": "The policy should clearly state the user's right to restrict processing and erasure of their data collected through cookies and other tracking technologies."}, {"section": "Other Information Sources: We receive information about you from other sources like third-party service providers, public databases, and our business and channel partners . This information may include business contact information, address, job title, email address, phone number . We may combine this information with information we collect through other means .", "article numbers": "15, 17", "legal provisions": "Right to restrict processing, Right to erasure", "amend": "The policy should clearly state the user's right to restrict processing and erasure of their data collected from third-party sources."}, {"section": "How We Use Personal Information We Collect We use the information we collect for the following purposes: to provide and support the Services, to improve the Services, to provide, support, and improve the Site, our partner programs, or communities, to process your requests, to process your payments or transactions, to provide you with information about our products and services, to combine information about you with other information we receive from third parties, to tailor the content or information that we provide to you, to protect the integrity or security of our business, the Site, Services, or third-party applications, or we may also use your information to: carry out our obligations, enforce our rights, comply with any legal obligation (including assisting our customer to comply with their legal obligations), where it is necessary for our legitimate interests, or to fulfill any other purpose for which you provided the information .", "article numbers": "15, 17", "legal provisions": "Right to restrict processing, Right to erasure", "amend": "The policy should clearly state the user's right to restrict processing and erasure of their data used for specific purposes."}, {"section": "How We Share Personal Information We may share information when one of the following circumstances applies: With your Consent: We may share your information with companies, organizations, and other third parties with your consent or to fulfill the purpose for which you provided the information .", "article numbers": "15, 17", "legal provisions": "Right to restrict processing, Right to erasure", "amend": "The policy should clearly state the user's right to restrict processing and erasure of their data shared with third parties."}, {"section": "With our Partners: We may share information with our partners (including resellers, referral, integration partners, experts in our community, or developer platform partners) for the purposes of the partnership agreement or to enable our partner programs .", "article numbers": "15, 17", "legal provisions": "Right to restrict processing, Right to erasure", "amend": "The policy should clearly state the user's right to restrict processing and erasure of their data shared with partners."}, {"section": "To Provide the Services, Partner Programs, or Communities: We may share your information with your teammates, account administrators, billing, or technical account users . We will also share your information with third-party applications (at your direction or the direction of an account owner) when an account holder uses the Services .", "article numbers": "15, 17", "legal provisions": "Right to restrict processing, Right to erasure", "amend": "The policy should clearly state the user's right to restrict processing and erasure of their data shared with teammates, account administrators, billing, or technical account users."}, {"section": "To deliver the Site, Services, partner programs, or communities, we may share your information with our service providers .", "article numbers": "15, 17", "legal provisions": "Right to restrict processing, Right to erasure", "amend": "The policy should clearly state the user's right to restrict processing and erasure of their data shared with service providers."}, {"section": "If you participate in our partner programs or communities, we may share your information with other partners, community members, customers, or other users (like when you comment or share information, rate an expert, or express interest in a partner integration) .", "article numbers": "13(1)(a)", "legal provisions": "Information to be provided where personal data are collected from the data subject", "amend": "The policy should clearly state the purpose for which the data is being collected and processed, and the legal basis for processing."}, {"section": "For Business Purposes: We provide information to vendors and services providers to help us provide the Site, Services, partner programs and communities, and for our business purposes .", "article numbers": "13(1)(b)", "legal provisions": "Information to be provided where personal data are collected from the data subject", "amend": "The policy should clearly state the categories of recipients of the data, including third-party service providers."}, {"section": "Examples of our service providers include hosting or infrastructure providers, chat widgets, helpdesk ticket providers, website hosts, customer relationship management providers, email providers, collaboration tools, and other service providers .", "article numbers": "13(1)(b)", "legal provisions": "Information to be provided where personal data are collected from the data subject", "amend": "The policy should clearly state the categories of recipients of the data, including third-party service providers."}, {"section": "To Market our Services or Partner Programs: We may share information that you provide us with third-party service providers who help us market our Services or our partner programs .", "article numbers": "13(1)(b)", "legal provisions": "Information to be provided where personal data are collected from the data subject", "amend": "The policy should clearly state the categories of recipients of the data, including third-party service providers."}, {"section": "These service providers may provide virtual or live events, email marketing tools, sales engagement, or lead generation tools .", "article numbers": "13(1)(b)", "legal provisions": "Information to be provided where personal data are collected from the data subject", "amend": "The policy should clearly state the categories of recipients of the data, including third-party service providers."}, {"section": "For Corporate Transactions: We may share personal data with actual or prospective acquirers, their representatives, and other relevant participants in, or during negotiations of, any sale, merger, acquisition, restructuring, divestiture, or change in control involving all or a portion of our business or assets, including in connection with a bankruptcy or similar proceedings .", "article numbers": "13(1)(b)", "legal provisions": "Information to be provided where personal data are collected from the data subject", "amend": "The policy should clearly state the categories of recipients of the data, including third-party service providers."}, {"section": "If we undergo a sale or corporate restructure, we may disclose information to a buyer or other successor in interest .", "article numbers": "13(1)(b)", "legal provisions": "Information to be provided where personal data are collected from the data subject", "amend": "The policy should clearly state the categories of recipients of the data, including third-party service providers."}, {"section": "For Legal Reasons: We may share your information if we believe that it is necessary to comply with any court order, law, legal