{"compliant": [{"section": "一、簡介", "article numbers": "13, 14", "legal provisions": "The policy provides information about the data controller, the purpose of data processing, and the types of data collected. This complies with the requirements of Articles 13 and 14 of the GDPR, which require controllers to provide individuals with information about the processing of their personal data."}, {"section": "二、本政策之適用範圍", "article numbers": "4, 9", "legal provisions": "The policy specifies the scope of the policy and clarifies that it applies to all personal data collected in relation to the services offered. This complies with the requirements of Articles 4 and 9 of the GDPR, which define the scope of the GDPR and the processing of special categories of data."}, {"section": "三、個資蒐集及使用目的", "article numbers": "5, 6", "legal provisions": "The policy outlines the purposes for which personal data is collected and used. This complies with the requirements of Articles 5 and 6 of the GDPR, which require that personal data be processed lawfully, fairly, and transparently, and that the processing be limited to specific, explicit, and legitimate purposes."}], "non_compliant": [{"section": "三、個資蒐集及使用目的", "article numbers": "12, 15, 17, 21", "legal provisions": "The policy does not provide information about the legal basis for processing personal data, the retention periods for data, the rights of individuals to access, rectify, erase, restrict, or object to the processing of their data, or the right to data portability. This is not compliant with the requirements of Articles 12, 15, 17, 21, and 20 of the GDPR, which require controllers to provide individuals with information about their rights and how to exercise them.", "amend": "The policy should be amended to include information about the legal basis for processing personal data, the retention periods for data, the rights of individuals to access, rectify, erase, restrict, or object to the processing of their data, and the right to data portability."}, {"section": "三、個資蒐集及使用目的", "article numbers": "32, 33, 34", "legal provisions": "The policy does not provide information about the security measures implemented to protect personal data from unauthorized access, use, disclosure, alteration, or destruction. This is not compliant with the requirements of Articles 32, 33, and 34 of the GDPR, which require controllers to implement appropriate technical and organizational measures to ensure the security of personal data.", "amend": "The policy should be amended to include information about the security measures implemented to protect personal data from unauthorized access, use, disclosure, alteration, or destruction."}, {"section": "三、個資蒐集及使用目的", "article numbers": "35, 36", "legal provisions": "The policy does not provide information about the procedures for notifying individuals of data breaches. This is not compliant with the requirements of Articles 35 and 36 of the GDPR, which require controllers to notify individuals of data breaches without undue delay.", "amend": "The policy should be amended to include information about the procedures for notifying individuals of data breaches."}, {"section": "三、個資蒐集及使用目的", "article numbers": "7, 8", "legal provisions": "The policy does not provide information about the data subject's right to withdraw consent. This is not compliant with the requirements of Articles 7 and 8 of the GDPR, which require controllers to obtain explicit consent from individuals for the processing of their personal data and to provide individuals with the right to withdraw their consent.", "amend": "The policy should be amended to include information about the data subject's right to withdraw consent."}]}
