{"compliant": [{"section": "Uber 會收集和使用資料，藉此提供可靠方便的交通、外送和其他產品與服務。", "article numbers": "6(1)", "legal provisions": "Lawfulness, fairness and transparency"}, {"section": "我們也會使用以下資料：\n提升使用者和服務的安全保障\n客服支援 \n研究與開發 \n啟用使用者之間的通訊功能 \n行銷和廣告\n向使用者傳送非行銷通知\n法律程序相關事宜", "article numbers": "6(1)(f)", "legal provisions": "Legitimate interests"}, {"section": "Uber 會使用我們收集的資料：\n1. 提供我們的服務。Uber 會使用資料提供、個人化、維護及改善服務。", "article numbers": "6(1)(b)", "legal provisions": "Performance of a contract"}, {"section": "這包含將資料用於下列事項：\n建立/更新帳戶。", "article numbers": "6(1)(b)", "legal provisions": "Performance of a contract"}, {"section": "啟用交通、外送和其他服務/功能，例如：\n使用定位資料提供乘客接送和訂單外送導航、計算預估抵達時間，以及追蹤搭乘或外送進度。", "article numbers": "6(1)(b)", "legal provisions": "Performance of a contract"}, {"section": "啟用涉及資料分享之功能，例如與乘客分享職業駕駛的名字和車輛資訊以便於上車，或使用預估抵達時間分享和費用平分功能。", "article numbers": "6(1)(b)", "legal provisions": "Performance of a contract"}, {"section": "根據個人資料 (例如位置和與其他使用者的距離)、使用者設定/偏好 (例如偏好目的地) 和非個人資料 (例如所要求之車輛類型)，為叫車使用者配對可用之職業駕駛與合作外送夥伴。", "article numbers": "6(1)(b)", "legal provisions": "Performance of a contract"}, {"section": "在某些國家/地區*，和/或與 Uber Pro 或 Uber One 等方案或 Uber 預約搭乘等產品相關時，系統也會根據取消率、評分和使用者行為資訊來確定配對狀況。", "article numbers": "6(1)(f)", "legal provisions": "Legitimate interests"}], "non_compliant": [{"section": "提升使用者和服務的安全保障", "article numbers": "6(1)(f)", "legal provisions": "Legitimate interests", "amend": "Uber should specify the legitimate interests pursued in relation to the processing of personal data for security purposes. They should also ensure that the processing is necessary and proportionate to achieve those interests."}, {"section": "客服支援", "article numbers": "6(1)(f)", "legal provisions": "Legitimate interests", "amend": "Uber should specify the legitimate interests pursued in relation to the processing of personal data for customer support. They should also ensure that the processing is necessary and proportionate to achieve those interests."}, {"section": "研究與開發", "article numbers": "6(1)(f)", "legal provisions": "Legitimate interests", "amend": "Uber should specify the legitimate interests pursued in relation to the processing of personal data for research and development. They should also ensure that the processing is necessary and proportionate to achieve those interests."}, {"section": "啟用使用者之間的通訊功能", "article numbers": "6(1)(f)", "legal provisions": "Legitimate interests", "amend": "Uber should specify the legitimate interests pursued in relation to the processing of personal data for enabling communication between users. They should also ensure that the processing is necessary and proportionate to achieve those interests."}, {"section": "行銷和廣告", "article numbers": "6(1)(f)", "legal provisions": "Legitimate interests", "amend": "Uber should specify the legitimate interests pursued in relation to the processing of personal data for marketing and advertising. They should also ensure that the processing is necessary and proportionate to achieve those interests. They should also provide users with clear and concise information about their right to object to such processing."}, {"section": "向使用者傳送非行銷通知", "article numbers": "6(1)(f)", "legal provisions": "Legitimate interests", "amend": "Uber should specify the legitimate interests pursued in relation to the processing of personal data for sending non-marketing notifications to users. They should also ensure that the processing is necessary and proportionate to achieve those interests."}, {"section": "法律程序相關事宜", "article numbers": "6(1)(f)", "legal provisions": "Legitimate interests", "amend": "Uber should specify the legitimate interests pursued in relation to the processing of personal data for legal proceedings. They should also ensure that the processing is necessary and proportionate to achieve those interests."}]}
