{"compliant": [{"section": "Our privacy practices are subject to the laws applicable in the places where we operate. This means that we will only process data in a particular country or region in the ways described in this statement if permitted by the laws of that country or region.", "article numbers": "3, 6, 7, 9", "legal provisions": "Territorial scope, Lawfulness of processing, Purpose limitation, Data minimisation"}, {"section": "In addition, please note the following:", "article numbers": "12, 13, 14", "legal provisions": "Information to be provided where personal data are collected from the data subject, Right to access, Right to rectification"}, {"section": "Users in Argentina: In accordance with Law 25.326, the Access to Public Information Agency, as the regulatory body, is responsible for receiving complaints and reports from data subjects when they believe their rights have been affected by a violation of local data protection regulations.", "article numbers": "12, 13, 14, 77", "legal provisions": "Information to be provided where personal data are collected from the data subject, Right to access, Right to rectification, Right to lodge a complaint with a supervisory authority"}, {"section": "Users in Australia: You can contact Uber here to learn about our compliance with the Australian Privacy Principles. Uber Customer Support and/or the relevant privacy team will address such contacts within a reasonable timeframe. You can also contact the Office of the Australian Information Commissioner here to raise concerns about such compliance.", "article numbers": "12, 13, 14, 77", "legal provisions": "Information to be provided where personal data are collected from the data subject, Right to access, Right to rectification, Right to lodge a complaint with a supervisory authority"}, {"section": "Users in Brazil: Please refer here to learn about Uber's privacy practices under the Brazilian General Data Protection Law (Lei Geral de Proteção de Dados - LGPD).", "article numbers": "12, 13, 14, 77", "legal provisions": "Information to be provided where personal data are collected from the data subject, Right to access, Right to rectification, Right to lodge a complaint with a supervisory authority"}], "non_compliant": [{"section": "This statement also governs Uber's collection of other data related to Uber services. For example, the data we may collect includes: contact information for restaurant or other merchant owners or employees on the Uber Eats or Postmates platforms, contact information for individuals who manage and use business customer accounts, or data for individuals who have started but not completed the online onboarding process for becoming a driver or delivery partner.", "article numbers": "5, 6, 13, 14, 25, 32, 37", "legal provisions": "Data minimisation, Lawfulness of processing, Right to access, Right to rectification, Data protection impact assessment, Transparency, Data portability", "amend": "The policy should specify the legal basis for processing each type of data, provide clear information about the purpose of processing, and ensure that data is collected only for specific, explicit and legitimate purposes. It should also include information about the data subject's rights, including the right to access, rectify, erase, restrict processing, and object to processing. The policy should also include information about the data subject's right to data portability."}, {"section": "In this statement, all individuals subject to this statement are referred to as \"Users.\"", "article numbers": "4, 12, 13, 14", "legal provisions": "Data subject, Information to be provided where personal data are collected from the data subject, Right to access, Right to rectification", "amend": "The policy should define the term \"Users\" more precisely, specifying the different categories of individuals subject to the statement. It should also provide clear and concise information about the data processing activities, including the purpose of processing, the types of data processed, the recipients of the data, and the data subject's rights."}]}
