{"compliant": [{"section": "調查與執法：Uber 須遵循美國的調查和執法權力聯邦貿易委員會。\n問題和爭議。符合歐盟-美國DPF，英國延伸至歐盟-美國DPF 和瑞士-美國DPF，Uber 承諾解決與 DPF 原則相關之關於我們收集和使用您個人資訊的投訴。乘客與合作外送夥伴可在此處聯絡 Uber，職業駕駛與合作合作外送夥伴亦得在此處聯絡 Uber，瞭解我們遵循之上述原則。他們亦得將投訴轉交給當地的資料保護機構，Uber 會與該機構合作解決投訴。如 DPF 原則附錄 I 所述，在特定情況下，DPF 提供權利，可援引具有約束力的仲裁來解決無法透過其他方式解決的投訴。\n使用者可進一步瞭解歐盟-美國DPF 和瑞士-美國要查看 DPF，請參閱此處，要查看 Uber 之認證，包括我們認證之資料範圍，請參閱此處。", "article numbers": "Article 33, Article 34, Article 77", "legal provisions": "Uber must cooperate with supervisory authorities and provide information to individuals upon request. Uber must provide individuals with a right to lodge a complaint with a supervisory authority. Individuals have the right to an effective judicial remedy against a supervisory authority's decision."}, {"section": "C.本隱私權聲明之更新\n我們可能會不定時更新本聲明。\n我們可能會不定時更新本聲明。若本聲明有重大變更，我們會事先透過 Uber App 或其他方式通知使用者，例如電子郵件。建議使用者定期檢閱本聲明，瞭解隱私權相關處理方式的最新資訊。\n在聲明更新後使用我們的服務，即表示您在法律允許範圍內同意更新版聲明。", "article numbers": "Article 13, Article 14", "legal provisions": "Uber must provide individuals with clear and concise information about the processing of their personal data. Uber must inform individuals of any changes to the processing of their personal data."}], "non_compliant": [{"section": "Uber 不會在歐洲經濟區、英國或瑞士收集或使用星號 (*) 標示的資料。", "article numbers": "Article 5(1)(b), Article 5(1)(c), Article 5(1)(e)", "legal provisions": "Personal data must be collected for specified, explicit and legitimate purposes. Personal data must be adequate, relevant and limited to what is necessary in relation to the purposes for which they are processed. Personal data must be accurate and, where necessary, kept up to date. ", "amend": "Uber must clearly identify the specific data it collects and processes in the EEA, UK, and Switzerland, and ensure that the data is collected for specific, explicit, and legitimate purposes. The data must be adequate, relevant, and limited to what is necessary for the stated purposes. Uber must also ensure that the data is accurate and kept up to date."}]}
