{"compliant": [{"section": "6.3  由於我們將會/可能蒐集、使用、揭露或處理您個人資料的目的取決於當時的情況，該目的可能未出現在上述項目中。不過，我們會在取得您同意的當時，向您告知該其他目的，除非隱私權法允許我們在未取得您同意的情況下即可處理適用的資料。", "article numbers": "Art. 6(1)(a), Art. 7", "legal provisions": "The processing of personal data shall be lawful only if and to the extent that at least one of the conditions in Article 6(1) is met.  The data subject has given consent to the processing of his or her personal data for one or more specific purposes.  The consent shall be freely given, specific, informed and unambiguous.  The data subject shall have the right to withdraw his or her consent at any time."}, {"section": "7.1  我們實施各式各樣的安全措施，以致力確保您的個人資料在我們的系統上安全無虞，但不可避免地無法保證絕對的安全。使用者個人資料包含在安全網路之後，只有具有該系統之特殊存取權的有限員工可以存取。", "article numbers": "Art. 32", "legal provisions": "The controller shall implement appropriate technical and organisational measures to ensure a level of security appropriate to the risk, including, inter alia, measures to ensure the ongoing confidentiality, integrity, availability and resilience of processing systems and services, the ability to restore the availability and access to personal data in a timely manner in the event of a physical or technical incident, and a process for regularly testing, assessing and evaluating the effectiveness of technical and organisational measures for ensuring the security of the processing."}, {"section": "7.2  我們會按照隱私權法及/或其他適用法律保存個人資料。也就是說，在我們合理認為 (i) 保存該個人資料不再符合蒐集個人資料之目的； (ii) 不再需要針對任何法律或業務目的保存個人資料時；以及 (iii) 沒有其他法律上之利益需要進一步保存該個人資料時，我們會立即銷毀您的個人資料，或是進行匿名化處理。若您停止使用本平台或是您使用本平台及/或本服務的權限遭到終止或撤銷，我們會繼續根據此隱私權政策及隱私權法所規定的義務，加以儲存、使用及/或揭露您的個人資料。根據適用法律，我們得於未事先通知您的情況下，安全處置您的個人資料。", "article numbers": "Art. 5(1)(e), Art. 17", "legal provisions": "Personal data shall be stored in a form which permits identification of data subjects for no longer than is necessary for the purposes for which the personal data are processed.  The controller shall take reasonable steps to ensure that personal data that are inaccurate, having regard to the purposes for which they are processed, are erased or rectified without delay.  The data subject shall have the right to obtain from the controller the erasure of personal data concerning him or her without undue delay where one of the following grounds applies:  the personal data are no longer necessary in relation to the purposes for which they were collected or otherwise processed;  the data subject withdraws consent on which the processing is based according to point (a) of Article 6(1) or point (a) of Article 9(2) and where there is no other legal ground for the processing;  the personal data have been unlawfully processed;  the personal data have to be erased for compliance with a legal obligation in Union or Member State law to which the controller is subject;  the personal data have been collected in relation to the offer of information society services referred to in Article 8(1)."}], "non_compliant": [{"section": "7.2  我們會按照隱私權法及/或其他適用法律保存個人資料。也就是說，在我們合理認為 (i) 保存該個人資料不再符合蒐集個人資料之目的； (ii) 不再需要針對任何法律或業務目的保存個人資料時；以及 (iii) 沒有其他法律上之利益需要進一步保存該個人資料時，我們會立即銷毀您的個人資料，或是進行匿名化處理。若您停止使用本平台或是您使用本平台及/或本服務的權限遭到終止或撤銷，我們會繼續根據此隱私權政策及隱私權法所規定的義務，加以儲存、使用及/或揭露您的個人資料。根據適用法律，我們得於未事先通知您的情況下，安全處置您的個人資料。", "article numbers": "Art. 5(1)(e), Art. 17", "legal provisions": "Personal data shall be stored in a form which permits identification of data subjects for no longer than is necessary for the purposes for which the personal data are processed.  The controller shall take reasonable steps to ensure that personal data that are inaccurate, having regard to the purposes for which they are processed, are erased or rectified without delay.  The data subject shall have the right to obtain from the controller the erasure of personal data concerning him or her without undue delay where one of the following grounds applies:  the personal data are no longer necessary in relation to the purposes for which they were collected or otherwise processed;  the data subject withdraws consent on which the processing is based according to point (a) of Article 6(1) or point (a) of Article 9(2) and where there is no other legal ground for the processing;  the personal data have been unlawfully processed;  the personal data have to be erased for compliance with a legal obligation in Union or Member State law to which the controller is subject;  the personal data have been collected in relation to the offer of information society services referred to in Article 8(1).", "amend": "The policy should explicitly state that the data subject will be informed of the erasure of their data, and that they will be given the opportunity to object to the erasure."}]}
