{"compliant": [{"section": "(f)   整合、剝奪、改組、重整、解散或其他銷售或轉移 (無論是持續經營的形式，或是破產、清算或類似程序的一部分) Shopee部分或全部資產的買方或其他繼任者，其中由Shopee所持有、有關本服務使用者的個人資料也在轉移的資產中；或是Shopee或其任何關係企業或關聯公司所參與之企業資產交易的對手；以及", "article numbers": "Article 4(10), Article 25(1), Article 46", "legal provisions": "This section complies with GDPR by outlining the transfer of personal data to a successor in the event of a merger, acquisition, or other business transaction. It ensures that appropriate safeguards are in place to protect the data during the transfer, as required by Article 46. It also clarifies the legal basis for the transfer, which is necessary for the performance of a contract or for legitimate interests, as per Article 6(1)(b) and (f)."}, {"section": "(g)   我們針對一或多個目的而向其揭露個人資料的第三方，該第三方可能會針對一或多個目的反過來蒐集和處理您的個人資料。", "article numbers": "Article 28", "legal provisions": "This section complies with GDPR by outlining the requirements for data processors. It ensures that the third-party recipient of personal data is subject to a data processing agreement that complies with Article 28, ensuring the protection of personal data."}, {"section": "8.2  我們得與廣告夥伴及第三方廣告、再行銷及/或方案供應商分享和使用者及其對本服務使用情形相關的統計及人口統計資訊。", "article numbers": "Article 6(1)(f), Article 13(1)(f), Article 14(1)(f)", "legal provisions": "This section complies with GDPR by outlining the legal basis for sharing anonymized statistical and demographic data with advertising partners. It ensures that the processing is necessary for the legitimate interests of the company, as per Article 6(1)(f), and that users are informed about this processing in accordance with Article 13(1)(f) and Article 14(1)(f)."}, {"section": "8.3  為避免疑慮，在隱私權法或其他適用法律允許組織 ，像是我們， 在未取得您的同意即可蒐集、使用或揭露您個人資料的情況下，由該等法律授予的該權限應繼續適用。承前述及適用法律允許下，我們得依據認定的法律理由使用您的個人資料以遵守我們的法律義務、履行對您的契約義務、實現合法利益，以及其他任何優先於您的保護數據權利之理由，或與合法主張有關所必要時。", "article numbers": "Article 6(1)(c), Article 6(1)(b), Article 6(1)(f), Article 9(2)(f)", "legal provisions": "This section complies with GDPR by outlining the legal basis for processing personal data in specific situations where consent is not required. It ensures that the processing is necessary for compliance with a legal obligation, for the performance of a contract, for legitimate interests, or for the establishment, exercise, or defense of legal claims, as per Article 6(1)(c), (b), (f), and Article 9(2)(f)."}, {"section": "8.4  在我方沒有責任的情況下，第三方可能會非法攔截或存取傳送至網站或是網站所包含的個人資料，技術可能會故障或無法如預期運作，或是有人可能會存取、濫用或誤用資訊。", "article numbers": "Article 32", "legal provisions": "This section complies with GDPR by acknowledging the potential risks of data breaches and outlining the company's responsibility to implement appropriate technical and organizational measures to protect personal data, as per Article 32."}], "non_compliant": [{"section": "8.2  我們得與廣告夥伴及第三方廣告、再行銷及/或方案供應商分享和使用者及其對本服務使用情形相關的統計及人口統計資訊。", "article numbers": "Article 25(1), Article 32", "legal provisions": "This section may not be fully compliant with GDPR. While it mentions sharing anonymized data, it doesn't explicitly state that the data is truly anonymized and cannot be re-identified. This could raise concerns about data minimization and security, as per Article 25(1) and Article 32. The policy should clarify the anonymization process and the security measures in place to protect the data.", "amend": "The policy should explicitly state that the data shared with advertising partners is truly anonymized and cannot be re-identified. It should also outline the specific technical and organizational measures implemented to ensure the security of the data, as per Article 32."}]}
