{"compliant": [{"section": "賣方（包含其員工、代理人、公司負責人及任何為賣方服務或代賣方使用本服務者）應遵守所有適用的隱私法律", "article numbers": "Article 2", "legal provisions": "General Data Protection Regulation (GDPR) requires all organizations to comply with applicable data protection laws."}, {"section": "對於從Shopee或買方接收到的任何買方個人資料（i）除非有合理必要需回應買方的查詢和回應、處理或完成交易，否則不得利用買方個人資料", "article numbers": "Article 6(1)(b)", "legal provisions": "This section aligns with GDPR's principle of data minimization, stating that personal data should only be processed for specific, explicit, and legitimate purposes."}, {"section": "(ii)應避免在Shopee平台之外使用此類資訊與買方聯繫", "article numbers": "Article 6(1)(b), Article 6(1)(f)", "legal provisions": "This section aligns with GDPR's principle of purpose limitation, stating that personal data should only be processed for the purposes for which it was collected. It also aligns with the legitimate interest principle, as long as the seller's interest in contacting the buyer is balanced against the buyer's right to privacy."}, {"section": "(iii)不得未經買方和Shopee的事先書面同意即將此類買方的個人資料揭露給任何未經授權的第三方", "article numbers": "Article 6(1)(a), Article 7", "legal provisions": "This section aligns with GDPR's principle of consent, requiring explicit consent from the data subject (buyer) for any disclosure of their personal data to third parties."}, {"section": "(iv)應採取足夠的安全措施來保護所持有的Shopee用戶個人資料，僅於符合個人資料法規範與符合前述目的情況下保存用戶個人資料，並依據蝦皮要求或交易完成後合理期間內儘快返還資料給蝦皮或儘速刪除這些資料", "article numbers": "Article 32, Article 5(1)(e), Article 17", "legal provisions": "This section aligns with GDPR's principles of data security, data retention, and the right to erasure. It requires the seller to implement appropriate technical and organizational measures to protect personal data, to only retain data for as long as necessary, and to delete data upon request or when it is no longer needed."}, {"section": "(v)如果有任何潛在的資料洩露或其他此類用戶資料遺失的情況，請透過dpo.tw@shopee.com通知Shopee的個人資料保護主管，賣方並應儘速透過蝦皮平台將潛在的洩漏或資料遺失狀況，通知所有可能受影響之用戶", "article numbers": "Article 33, Article 34", "legal provisions": "This section aligns with GDPR's requirements for data breach notification. It requires the seller to notify Shopee's data protection officer and affected users in case of a data breach."}], "non_compliant": [{"section": "應遵守所有適用的隱私法律", "article numbers": "Article 2", "legal provisions": "While this section acknowledges the need to comply with data protection laws, it does not explicitly mention GDPR. To be fully compliant, it should explicitly state that the seller will comply with GDPR.", "amend": "賣方應遵守所有適用的隱私法律，包括歐盟一般資料保護規則 (GDPR)"}, {"section": "應避免在Shopee平台之外使用此類資訊與買方聯繫", "article numbers": "Article 6(1)(f)", "legal provisions": "This section does not provide sufficient detail about the legitimate interest of the seller in contacting the buyer outside the Shopee platform. To be fully compliant, it should clearly define the legitimate interest and ensure it is proportionate to the buyer's right to privacy.", "amend": "(ii)應避免在Shopee平台之外使用此類資訊與買方聯繫，除非有明確的合法利益，且此利益與買方隱私權相符，例如提供與交易相關的資訊或服務更新。"}, {"section": "不得未經買方和Shopee的事先書面同意即將此類買方的個人資料揭露給任何未經授權的第三方", "article numbers": "Article 7", "legal provisions": "This section requires written consent, which may not be the most practical or user-friendly method. GDPR allows for other forms of consent, such as electronic consent.", "amend": "(iii)不得未經買方和Shopee的事先明確同意即將此類買方的個人資料揭露給任何未經授權的第三方。同意應以明確、自由、具體、知情且明確的方式取得。"}, {"section": "應採取足夠的安全措施來保護所持有的Shopee用戶個人資料", "article numbers": "Article 32", "legal provisions": "This section is too general and does not specify the types of security measures that should be implemented. GDPR requires specific technical and organizational measures to be implemented.", "amend": "(iv)應採取適當的技術和組織措施來保護所持有的Shopee用戶個人資料，例如加密、匿名化、存取控制和安全審計。"}, {"section": "僅於符合個人資料法規範與符合前述目的情況下保存用戶個人資料", "article numbers": "Article 5(1)(e)", "legal provisions": "This section does not specify the criteria for determining the appropriate retention period for personal data. GDPR requires a clear and specific retention policy.", "amend": "(iv)應僅於符合個人資料法規範與符合前述目的情況下保存用戶個人資料，並應制定明確的資料保留政策，以確保資料僅保留必要的時間。"}, {"section": "並依據蝦皮要求或交易完成後合理期間內儘快返還資料給蝦皮或儘速刪除這些資料", "article numbers": "Article 17", "legal provisions": "This section does not specify the timeframe for returning or deleting data. GDPR requires a clear and specific timeframe for data deletion.", "amend": "(iv)應依據蝦皮要求或交易完成後合理期間內儘快返還資料給蝦皮或儘速刪除這些資料，最遲不超過交易完成後 [具體時間]。"}, {"section": "如果有任何潛在的資料洩露或其他此類用戶資料遺失的情況，請透過dpo.tw@shopee.com通知Shopee的個人資料保護主管", "article numbers": "Article 33", "legal provisions": "This section does not specify the timeframe for notifying the data protection officer. GDPR requires notification within 72 hours of becoming aware of a data breach.", "amend": "(v)如果有任何潛在的資料洩露或其他此類用戶資料遺失的情況，請透過dpo.tw@shopee.com通知Shopee的個人資料保護主管，並在發現資料洩露後 72 小時內通知。"}, {"section": "賣方並應儘速透過蝦皮平台將潛在的洩漏或資料遺失狀況，通知所有可能受影響之用戶", "article numbers": "Article 34", "legal provisions": "This section does not specify the timeframe for notifying affected users. GDPR requires notification without undue delay.", "amend": "(v)賣方並應儘速透過蝦皮平台將潛在的洩漏或資料遺失狀況，通知所有可能受影響之用戶，並在發現資料洩露後無不當延誤地通知。"}, {"section": "如有違反前述規定之情事，賣方應承擔相關法律責任並賠償Shopee因此所生的一切損失及費用", "article numbers": "Article 82", "legal provisions": "This section does not specify the types of legal consequences for non-compliance. GDPR provides for a range of legal consequences, including fines and compensation.", "amend": "如有違反前述規定之情事，賣方應承擔相關法律責任，包括但不限於罰金、罰鍰、違約金、賠償金、訴訟費及合理的律師費等，並賠償Shopee因此所生的一切損失及費用。"}
]
}
