{"compliant": [{"section": "Applicability: This Policy applies to personal data that Midjourney collects, uses, and discloses and which may include: (i) data collected through the Services, (ii) data collected through the process of training Midjourney machine learning algorithms, (iii) data collected through Midjourney websites, and (iv) data collected from third party sources.", "article numbers": "Art. 6(1)(a), Art. 6(1)(b), Art. 6(1)(c), Art. 6(1)(f)", "legal provisions": "Lawful basis for processing: Consent, Contract, Legal Obligation, Legitimate Interest"}, {"section": "Third party sources may include, but not be limited to: public databases, commercial data sources, and the public internet.", "article numbers": "Art. 5(1)(a), Art. 5(1)(b), Art. 5(1)(c), Art. 5(1)(d), Art. 5(1)(e)", "legal provisions": "Principles of data processing: Lawfulness, Fairness and transparency, Purpose limitation, Data minimisation, Accuracy, Storage limitation, Integrity and confidentiality, Accountability"}, {"section": "When you make purchases, we use third-party payment processors to collect credit card or other financial information. Midjourney does not store the credit card or payment information you provide, only confirmation that payment was made.", "article numbers": "Art. 32", "legal provisions": "Security of processing"}, {"section": "This Policy does not apply to the following information:\n\nPersonal Data about Midjourney employees and candidates, and certain contractors and agents acting in similar roles.", "article numbers": "Art. 2", "legal provisions": "Scope of application"}, {"section": "Changes: We may update this Policy from time-to-time to reflect changes in legal, regulatory, operational requirements, our practices, and other factors. Please check this Policy periodically for updates. If any of the changes are unacceptable to you, you should cease interacting with us. When required under applicable law, we will notify you of any changes to this Policy.", "article numbers": "Art. 13, Art. 14", "legal provisions": "Information to be provided where personal data are collected from the data subject, Information to be provided where personal data are not collected from the data subject"}, {"section": "Definitions: Through this Policy, You, or Your means the individual accessing or using the Service, or the company, or other legal entity on behalf of which such individual is accessing or using the Service, as applicable. Company (referred to as either \"the Company\", \"We\", \"Us\" or \"Our\" in this Agreement) refers to Midjourney LLC. Usage Data refers to data collected automatically, either generated by the use of the Service or from the Service infrastructure itself (for example, the duration of a page visit).", "article numbers": "Art. 4", "legal provisions": "Definitions"}], "non_compliant": [{"section": "As used in this Policy, “personal data” means any information that relates to, describes, could be used to identify an individual, directly or indirectly.", "article numbers": "Art. 4", "legal provisions": "Definitions", "amend": "The definition of personal data should be aligned with the GDPR definition, which includes any information relating to an identified or identifiable natural person."}, {"section": "This Policy does not apply to the following information:\n\nPersonal Data about Midjourney employees and candidates, and certain contractors and agents acting in similar roles.", "article numbers": "Art. 2", "legal provisions": "Scope of application", "amend": "The policy should clarify whether the exclusion of employee data is justified under the GDPR's scope of application. If not, the policy should be amended to include employee data."}]}
