{"compliant": [{"section": "當您參加PChome 網路家庭與其他廠商合作辦理的贈獎活動、行銷活動時，PChome 網路家庭或其合作廠商將請您提供為了使您能參加活動所需的相關資料，包括但不限於前述之基本資料、配送資料等。", "article numbers": "6(1)", "legal provisions": "Lawfulness of processing"}, {"section": "為提供LBS服務所需之資料：當您同意啟動PChome 網路家庭或與PChome 網路家庭合作之其他廠商提供的移動定位服務Location Based Service，以下稱LBS服務或收藏店家/商品服務，PChome 網路家庭將分別依據您的網際網路協定IP位址、裝置位置資訊、GPS定位位置及收藏店家/商品服務銷售情形，不定時以推播方式發布收藏店家/商品服務優惠訊息或顯示收藏店家目前營運情況至您啟用LBS服務之裝置中。", "article numbers": "6(1), 7", "legal provisions": "Lawfulness of processing, Specific conditions for processing"}, {"section": "此外，為提升服務品質，PChome 網路家庭會依照PChome 網路家庭相關網站或行動應用程式所提供服務之性質，記錄您的網際網路協定IP位址、裝置位置資訊、GPS定位位置、您在PChome 網路家庭相關網站內的瀏覽活動例如，使用者所使用的軟硬體、所點選的網頁、以及行動應用程式之使用紀錄等資料，這些資料將作為流量總量分析、網路行為調查和提供個人化服務之用，以便於改善PChome 網路家庭相關網站與行動應用程式的服務品質並提供予您最適合的個人化服務。", "article numbers": "6(1), 7, 13", "legal provisions": "Lawfulness of processing, Specific conditions for processing, Profiling"}], "non_compliant": [{"section": "當您參加PChome 網路家庭與其他廠商合作辦理的贈獎活動、行銷活動時，PChome 網路家庭或其合作廠商將請您提供為了使您能參加活動所需的相關資料，包括但不限於前述之基本資料、配送資料等。", "article numbers": "5, 13, 14", "legal provisions": "Data minimisation, Transparency, Information", "amend": "The policy should clearly state the specific data collected for each activity, the purpose of the data collection, and the legal basis for processing. It should also inform users about their rights, including the right to access, rectify, erase, and restrict processing."}, {"section": "為提供LBS服務所需之資料：當您同意啟動PChome 網路家庭或與PChome 網路家庭合作之其他廠商提供的移動定位服務Location Based Service，以下稱LBS服務或收藏店家/商品服務，PChome 網路家庭將分別依據您的網際網路協定IP位址、裝置位置資訊、GPS定位位置及收藏店家/商品服務銷售情形，不定時以推播方式發布收藏店家/商品服務優惠訊息或顯示收藏店家目前營運情況至您啟用LBS服務之裝置中。", "article numbers": "5, 13, 14", "legal provisions": "Data minimisation, Transparency, Information", "amend": "The policy should clearly state the specific data collected for LBS services, the purpose of the data collection, and the legal basis for processing. It should also inform users about their rights, including the right to access, rectify, erase, and restrict processing."}, {"section": "此外，為提升服務品質，PChome 網路家庭會依照PChome 網路家庭相關網站或行動應用程式所提供服務之性質，記錄您的網際網路協定IP位址、裝置位置資訊、GPS定位位置、您在PChome 網路家庭相關網站內的瀏覽活動例如，使用者所使用的軟硬體、所點選的網頁、以及行動應用程式之使用紀錄等資料，這些資料將作為流量總量分析、網路行為調查和提供個人化服務之用，以便於改善PChome 網路家庭相關網站與行動應用程式的服務品質並提供予您最適合的個人化服務。", "article numbers": "5, 13, 14, 21, 22", "legal provisions": "Data minimisation, Transparency, Information, Right to object, Automated decision-making", "amend": "The policy should clearly state the specific data collected for service improvement, the purpose of the data collection, and the legal basis for processing. It should also inform users about their rights, including the right to access, rectify, erase, and restrict processing. The policy should also provide information about the logic involved in profiling and the significance and envisaged consequences of such processing for the data subject. It should also inform users about their right to object to profiling and to automated decision-making."}]}
