{"compliant": [{"section": "Uber is committed to protecting the personal data of its users, regardless of where the user is located, where or by whom the personal data is processed.", "article numbers": "Article 5", "legal provisions": "Principle of data minimisation, purpose limitation, storage limitation, integrity and confidentiality, accountability"}, {"section": "This includes implementing global measures to protect user data, including:", "article numbers": "Article 32", "legal provisions": "Security of processing"}, {"section": "Protecting user data in transit (including through encryption) and at rest.", "article numbers": "Article 32", "legal provisions": "Security of processing"}, {"section": "Mandating company-wide training on privacy and data security.", "article numbers": "Article 39", "legal provisions": "Data protection by design and by default"}, {"section": "Implementing internal policies and procedures to limit access to and use of user data.", "article numbers": "Article 29", "legal provisions": "Data protection officer"}, {"section": "Restricting access to user data by government and law enforcement unless required by law, in the event of an imminent threat to security, or with the user's consent.", "article numbers": "Article 6", "legal provisions": "Lawfulness, fairness and transparency"}, {"section": "See Uber's Transparency Report for more information on our practices regarding law enforcement requests.", "article numbers": "Article 15", "legal provisions": "Right of access by the data subject"}, {"section": "When we transfer user data from the European Economic Area, the UK and Switzerland, we do so in accordance with the following, as necessary to perform the agreement with the user, consent, adequacy decisions regarding the country of transfer (see here, here, or here), and standard contractual clauses adopted by the European Commission (and equivalent clauses approved by the UK and Switzerland) and transfer mechanisms such as the EU-U.S. Privacy Shield Framework (“EU-U.S. Privacy Shield”), the UK extension to the EU-U.S. Privacy Shield and the Swiss-U.S. Privacy Shield Framework (“Swiss-U.S. Privacy Shield”), as set forth by the U.S. Department of Commerce.", "article numbers": "Article 44", "legal provisions": "Transfers of personal data to third countries or international organisations"}], "non_compliant": [{"section": "This includes processing your data on Uber servers in the United States, and globally transferring or allowing access to your data to:", "article numbers": "Article 5", "legal provisions": "Principle of data minimisation, purpose limitation, storage limitation, integrity and confidentiality, accountability", "amend": "The policy should specify the exact purposes for which data is processed and the legal basis for each purpose. It should also clarify the specific locations where data is processed and the safeguards in place to ensure data security during transfer."}, {"section": "Provide you with services anywhere, anytime.", "article numbers": "Article 6", "legal provisions": "Lawfulness, fairness and transparency", "amend": "The policy should specify the legal basis for processing data for this purpose, such as performance of a contract or legitimate interests."}, {"section": "Allow you to access your information, such as trip/order history, anywhere, anytime.", "article numbers": "Article 15", "legal provisions": "Right of access by the data subject", "amend": "The policy should provide clear and concise information about how users can access their data, including the methods and procedures involved."}, {"section": "Provide contact and response access to Uber customer support personnel.", "article numbers": "Article 13", "legal provisions": "Information to be provided where personal data are collected from the data subject", "amend": "The policy should provide clear and concise information about the contact details of Uber's customer support personnel and the procedures for contacting them."}, {"section": "Respond to government or law enforcement information requests as required.", "article numbers": "Article 6", "legal provisions": "Lawfulness, fairness and transparency", "amend": "The policy should specify the legal basis for responding to government or law enforcement requests, such as legal obligation or public interest."}]}
