{"compliant": [{"section": "Uber collects the following data:\n\n* Data provided by users\n* Data generated during the use of our services\n* Other sources", "article numbers": "Art. 13, Art. 14", "legal provisions": "Right to be informed"}, {"section": "Account information: We collect data when users create or update their Uber account or place an order through the guest checkout feature. This includes name, email address, phone number, login name and password, address, basic profile photo, payment or banking information (including related payment verification information), user settings (including accessibility settings), and Uber partner loyalty program information.", "article numbers": "Art. 5(1)(a), Art. 6(1)(b)", "legal provisions": "Lawfulness, fairness and transparency, Purpose limitation"}, {"section": "For drivers and delivery partners, this also includes their vehicle or insurance information, emergency contact information, and health or eligibility documentation required to provide services using the Uber App.", "article numbers": "Art. 5(1)(a), Art. 6(1)(b)", "legal provisions": "Lawfulness, fairness and transparency, Purpose limitation"}, {"section": "Background check information (drivers and delivery partners): This includes information submitted during the driver/delivery partner onboarding process, such as driving records or criminal records (where legally permitted), driver's license status, known aliases, previous addresses, and employment history.", "article numbers": "Art. 5(1)(a), Art. 6(1)(b)", "legal provisions": "Lawfulness, fairness and transparency, Purpose limitation"}], "non_compliant": [{"section": "Uber collects the following data:\n\n* Data provided by users\n* Data generated during the use of our services\n* Other sources", "article numbers": "Art. 13, Art. 14", "legal provisions": "Right to be informed", "amend": "The policy should specify the specific types of data collected from each source, including data generated during the use of services, and other sources. It should also provide a clear and concise explanation of the legal basis for processing each type of data."}, {"section": "Please see here for a summary of the data we collect and how we use it.", "article numbers": "Art. 13, Art. 14", "legal provisions": "Right to be informed", "amend": "The policy should provide a comprehensive summary of the data collected and used, including the purposes of processing, the legal basis for processing, and the recipients of the data. It should also include information about data retention periods and data security measures."}, {"section": "For drivers and delivery partners, this also includes their vehicle or insurance information, emergency contact information, and health or eligibility documentation required to provide services using the Uber App.", "article numbers": "Art. 9", "legal provisions": "Processing of special categories of personal data", "amend": "The policy should provide a clear and specific explanation of the legal basis for processing sensitive personal data, such as health or eligibility documentation. It should also include information about the safeguards implemented to protect this data."}, {"section": "Background check information (drivers and delivery partners): This includes information submitted during the driver/delivery partner onboarding process, such as driving records or criminal records (where legally permitted), driver's license status, known aliases, previous addresses, and employment history.", "article numbers": "Art. 9", "legal provisions": "Processing of special categories of personal data", "amend": "The policy should provide a clear and specific explanation of the legal basis for processing sensitive personal data, such as criminal records. It should also include information about the safeguards implemented to protect this data."}]}
