{"compliant": [{"section": "We may update Our Privacy Policy from time to time. We will notify You of any changes by posting the new Privacy Policy on this page.", "article numbers": "Article 13(2)(a), Article 14(2)(a)", "legal provisions": "The controller shall provide the data subject with information on the following: (a) the purposes of the processing for which the personal data are intended; (a) the recipients or categories of recipients to whom the personal data have been or are likely to be disclosed, in particular recipients in third countries or international organisations."}, {"section": "We will let You know via email and/or a prominent notice on Our Service, prior to the change becoming effective and update the \"Last updated\" date at the top of this Privacy Policy.", "article numbers": "Article 13(2)(b), Article 14(2)(b)", "legal provisions": "The controller shall provide the data subject with information on the following: (b) the period for which the personal data will be stored, or, if that is not possible, the criteria used to determine that period; (b) the existence of the right to request from the controller rectification or erasure of personal data or restriction of processing concerning the data subject or to object to such processing."}, {"section": "You are advised to review this Privacy Policy periodically for any changes.", "article numbers": "Article 13(1), Article 14(1)", "legal provisions": "The controller shall provide the data subject with the following information: (1) the identity and the contact details of the controller and, where applicable, of the controller's representative; (1) the identity and the contact details of the controller and, where applicable, of the controller's representative."}], "non_compliant": [{"section": "Changes to this Privacy Policy are effective when they are posted on this page.", "article numbers": "Article 13(2)(c), Article 14(2)(c)", "legal provisions": "The controller shall provide the data subject with information on the following: (c) the right to withdraw consent at any time, where consent is the legal basis for processing; (c) the right to lodge a complaint with a supervisory authority.", "amend": "The policy should also inform users about their right to withdraw consent at any time and their right to lodge a complaint with a supervisory authority."}]}
