{"compliant": [{"section": "Access: You can request more information about the Personal Data we hold about you and request a copy of such Personal Data.", "article numbers": "Article 15", "legal provisions": "Right of access"}, {"section": "You can also access certain of your Personal Data by choosing to export your data.", "article numbers": "Article 15", "legal provisions": "Right of access"}, {"section": "Rectification: If you believe that any Personal Data we are holding about you is incorrect or incomplete, you can request that we correct or supplement such data.", "article numbers": "Article 16", "legal provisions": "Right to rectification"}, {"section": "You can also correct some of this information directly by editing your Account Settings.", "article numbers": "Article 16", "legal provisions": "Right to rectification"}, {"section": "You can correct some of this information directly by editing your Applets or Platform Services.", "article numbers": "Article 16", "legal provisions": "Right to rectification"}, {"section": "Erasure: You can request that we erase some or all of your Personal Data from our systems.", "article numbers": "Article 17", "legal provisions": "Right to erasure"}, {"section": "Withdrawal of Consent: If we are processing your Personal Data based on your consent (as indicated at the time of collection of such data), you have the right to withdraw your consent at any time.", "article numbers": "Article 7", "legal provisions": "Right to withdraw consent"}, {"section": "Please note, however, that if you exercise this right, you may have to then provide express consent on a case-by-case basis for the use or disclosure of certain of your Personal Data, if such use or disclosure is necessary to enable you to utilize some or all of our Service.", "article numbers": "Article 7", "legal provisions": "Right to withdraw consent"}, {"section": "Portability: You can ask for a copy of your Personal Data in a machine-readable format.", "article numbers": "Article 20", "legal provisions": "Right to data portability"}, {"section": "You can also request that we transmit the data to another controller where technically feasible.", "article numbers": "Article 20", "legal provisions": "Right to data portability"}, {"section": "Objection: You can contact us to let us know that you object to the further use or disclosure of your Personal Data for certain purposes, such as for direct marketing purposes.", "article numbers": "Article 21", "legal provisions": "Right to object"}, {"section": "Restriction of Processing: You can ask us to restrict further processing of your Personal Data.", "article numbers": "Article 18", "legal provisions": "Right to restriction of processing"}, {"section": "Right to File Complaint: You have the right to lodge a complaint about IFTTT’s practices with respect to your Personal Data with the supervisory authority of your country or EU Member State.", "article numbers": "Article 77", "legal provisions": "Right to lodge a complaint with a supervisory authority"}], "non_compliant": [{"section": "For more information about these rights, or to submit a request, please email IFTTT@gdpr-rep . com .", "article numbers": "Article 12", "legal provisions": "Information to be provided to the data subject", "amend": "The policy should provide a clear and concise description of the procedures for exercising the rights, including the contact details of the data protection officer or other designated point of contact."}, {"section": "Please note that in some circumstances, we may not be able to fully comply with your request, such as if it is frivolous or extremely impractical, if it jeopardizes the rights of others, or if it is not required by law, but in those circumstances, we will still respond to notify you of such a decision.", "article numbers": "Article 12", "legal provisions": "Information to be provided to the data subject", "amend": "The policy should provide clear and concise information about the grounds for refusal, including the legal basis for the refusal."}, {"section": "In some cases, we may also need to you to provide us with additional information, which may include Personal Data, if necessary to verify your identity and the nature of your request.", "article numbers": "Article 12", "legal provisions": "Information to be provided to the data subject", "amend": "The policy should provide clear and concise information about the types of personal data that may be required for verification purposes and the purpose of such verification."}, {"section": "The Service is hosted and operated in the United States (“U . S . ”) through IFTTT and its service providers, and if you do not reside in the U . S . , laws in the U . S . may differ from the laws where you reside.", "article numbers": "Article 49", "legal provisions": "Transfers of personal data to third countries or international organisations", "amend": "The policy should provide clear and concise information about the safeguards used to protect personal data transferred to third countries, including the legal basis for the transfer and the appropriate safeguards in place."}]}
