{"compliant": [{"section": "We do not knowingly collect or solicit personally identifiable information from children under 13; if you are a child under 13, please do not attempt to register for the Service or send any personal information about yourself to us.", "article numbers": "Art. 8", "legal provisions": "Protection of personal data of children"}, {"section": "If we learn we have collected personal information from a child under 13, we will delete that information as quickly as possible.", "article numbers": "Art. 17", "legal provisions": "Right to erasure ('right to be forgotten')"}, {"section": "If you believe that a child under 13 may have provided us personal information, please contact us using this form and use the report abuse category.", "article numbers": "Art. 12", "legal provisions": "Information to be provided to the data subject"}, {"section": "You may not use the Service: (i) to post or transmit, or cause to be posted or transmitted, any communication or solicitation designed or intended to obtain password, account, or private information from any IFTTT user; (ii) to violate the security of any computer network, crack passwords or security encryption codes, transfer or store material that is deemed threatening or obscene, or engage in any kind of illegal activity; (iii) to run Maillist, Listserv, any form of auto-responder, or spam through the Service; (iv) in connection with or to promote any products, services, or materials that constitute, promote or are used primarily for the purpose of dealing in: spyware, adware, or other malicious programs or code, counterfeit goods, items subject to US embargo, hate materials or materials urging acts of terrorism or violence, goods made from protected animal/plant species, recalled goods, any hacking, surveillance, interception, or descrambling equipment, cigarettes, illegal drugs and paraphernalia, unlicensed sale of prescription drugs and medical devices, pornography, prostitution, body parts and bodily fluids, stolen products and items used for theft, fireworks, explosives, and hazardous materials, government IDs, police items, unlicensed trade or dealing in stocks and securities, gambling items, professional services regulated by state licensing regimes, non-transferable items such as airline tickets or event tickets, non-packaged food items, weapons and accessories; (v) in any manner or for any purpose that violates any law or regulation, any right of any person, including but not limited to intellectual property rights, contract rights, rights of privacy, or rights of personality, or in any manner inconsistent with these Terms or with any terms or conditions or obligations relating to any third party website, app, API or the like; (vi) in connection with life support systems, or other mission critical applications where human life or property may be at stake.", "article numbers": "Art. 6", "legal provisions": "Lawfulness of processing"}, {"section": "You understand that the Service is not designed for such purposes and that its failure in such cases could lead to death, personal injury, or severe property or environmental damage for which IFTTT is not responsible; or (vii) to sell, lease, share, transfer, repurpose for sale or sublicense the Service without IFTTT's prior, express, written permission.", "article numbers": "Art. 5", "legal provisions": "Principles relating to processing of personal data"}, {"section": "Anything you post, upload, share, store, or otherwise provide through the Service is your “User Submission.” Some User Submissions are viewable by other users.", "article numbers": "Art. 13", "legal provisions": "Information to be provided where personal data are collected from the data subject"}], "non_compliant": [{"section": "Restrictions You may not use the Service: (i) to post or transmit, or cause to be posted or transmitted, any communication or solicitation designed or intended to obtain password, account, or private information from any IFTTT user; (ii) to violate the security of any computer network, crack passwords or security encryption codes, transfer or store material that is deemed threatening or obscene, or engage in any kind of illegal activity; (iii) to run Maillist, Listserv, any form of auto-responder, or spam through the Service; (iv) in connection with or to promote any products, services, or materials that constitute, promote or are used primarily for the purpose of dealing in: spyware, adware, or other malicious programs or code, counterfeit goods, items subject to US embargo, hate materials or materials urging acts of terrorism or violence, goods made from protected animal/plant species, recalled goods, any hacking, surveillance, interception, or descrambling equipment, cigarettes, illegal drugs and paraphernalia, unlicensed sale of prescription drugs and medical devices, pornography, prostitution, body parts and bodily fluids, stolen products and items used for theft, fireworks, explosives, and hazardous materials, government IDs, police items, unlicensed trade or dealing in stocks and securities, gambling items, professional services regulated by state licensing regimes, non-transferable items such as airline tickets or event tickets, non-packaged food items, weapons and accessories; (v) in any manner or for any purpose that violates any law or regulation, any right of any person, including but not limited to intellectual property rights, contract rights, rights of privacy, or rights of personality, or in any manner inconsistent with these Terms or with any terms or conditions or obligations relating to any third party website, app, API or the like; (vi) in connection with life support systems, or other mission critical applications where human life or property may be at stake.", "article numbers": "Art. 14", "legal provisions": "Information to be provided where personal data are not obtained from the data subject", "amend": "The policy should clearly state the purpose of data processing and the legal basis for processing."}, {"section": "You understand that the Service is not designed for such purposes and that its failure in such cases could lead to death, personal injury, or severe property or environmental damage for which IFTTT is not responsible; or (vii) to sell, lease, share, transfer, repurpose for sale or sublicense the Service without IFTTT's prior, express, written permission.", "article numbers": "Art. 21", "legal provisions": "Right to object", "amend": "The policy should provide information about the data subject's right to object to processing based on legitimate interests."}, {"section": "Anything you post, upload, share, store, or otherwise provide through the Service is your “User Submission.” Some User Submissions are viewable by other users.", "article numbers": "Art. 15", "legal provisions": "Right of access by the data subject", "amend": "The policy should provide information about the data subject's right to access their personal data."}]}
